{
    "12345": [
        {
            "PersonID": "jjXRlB6ae4y7GiGWfbb6Jw",
            "PersonURLpart": "/user_details?userid=jjXRlB6ae4y7GiGWfbb6Jw",
            "PersonName": "Michele M.",
            "ReviewDate": "2021-05-01",
            "Rating": 5,
            "ReviewText": " Time to give these legends another glowing review.   Had an unexpected dental catastrophe right before I was suppose to get my 2nd covid shot.  The staff were able to squeeze me in the next morning and I was sent to a e specialists for a further scan.  Turned out I my tooth was super infected and an ancient root canalHad given up doing it's job.   I find this all put Friday afternoon and get prescribed antibiotics.  7pm I'm feeling like my inflammation is out of control so I text dr Dillon and he says he will come into work on Saturday and extract the tooth. So here I am Saturday afternoon. With my tooth extracted and a lot leas pain and anguish.   I absolutely love these guys.    They really care about their patients and are highly skilled.  Dr Dillon had that tooth out in 3 minutes flat!"
        },
        {
            "PersonID": "H44-rvYYx6i5yue19qHkWw",
            "PersonURLpart": "/user_details?userid=H44-rvYYx6i5yue19qHkWw",
            "PersonName": "C F.",
            "ReviewDate": "2021-06-18",
            "Rating": 2,
            "ReviewText": " The dentist and clinical staff are really nice and professional put me at ease but I feel like the administration and billing staff are kind of a mess. Dr Patel really helped educate me on everything involving my teeth and what's needed and despite one billing/insurance issue, I booked in my second appt in two weeks get going on some cosmetic improvement on my teeth (possible crowns or veneers). Yesterday I received an email saying I needed to get in touch with the clinic regarding my appt and that my number was disconnected, so I immediately replied with the best number to reach me that they could call anytime and also attempted to call the office 3X with no answer (during business hours)Then within a couple hours after the email the office manager emails me saying he's cancelled my appointment and all further appointments with the office. My appointment is still weeks away and I've just never dealt with a place that cancels you out as a future patient within a couple hours but is also impossible to get ahold of.I have replied to the two separate emails without any response still a day later- Im super confused about it and feel like I basically got fired as a patient which is weird because I was planning on spending thousands of dollars there. Bummed that I need to start completely over at another dental office now Business owner information Hardik C. Business Owner 6/22/2021 Hey C.F.,I’m extremely disappointed in your experience with our office if you could please reach out to me at directly drharcho@enameldentistry or call me at our domain office at 512-646-0815 - I would love to make sure that I can rectify the situation for you. Read more"
        },
        {
            "PersonID": "92QdwcrmHAk5v41dvfRvmA",
            "PersonURLpart": "/user_details?userid=92QdwcrmHAk5v41dvfRvmA",
            "PersonName": "Andrea T.",
            "ReviewDate": "2021-08-01",
            "Rating": 1,
            "ReviewText": " Enamel's professionalism has slowly gone downhill. I have been to this location before, about a year and a half ago, for a cleaning and received great service then. But now, the staff is especially curt. Austin has several great dental offices- I'll be finding a new one who truly cares about their patients."
        },
        {
            "PersonID": "vLd3Ry8WlnQx2S9gzBpWpw",
            "PersonURLpart": "/user_details?userid=vLd3Ry8WlnQx2S9gzBpWpw",
            "PersonName": "Kara W.",
            "ReviewDate": "2020-06-07",
            "Rating": 5,
            "ReviewText": " Before Enamel Dentistry, I had never had a 5-star dental experience in my life. I get major anxiety visiting the dentist, but that quickly dissipated here.My regular dentist is closed and not answering any emails or phone calls and I had a concern about my crowns.It was easy to schedule a quick exam and cleaning and Maddy reached out via email to confirm additional details and information they needed.They are taking proper measures to ensure that they're being as safe as possible with COVID-19, which is reassuring.They were also just really friendly and educational. The hygienist gave me insight into my tooth pain that nobody had ever mentioned before (I have bad allergies and my sinuses can impact my tooth sensitivity). They also took photos of my teeth and actually went over my xrays and photos to make sure I understood what the doctor saw.They went over the patient plan and worked with my insurance, to make the whole process as painless as possible.Bonus: they offer Netflix on the tv while you're sitting in the exam chair. Looking forward to continuing with Enamel Dentistry."
        },
        {
            "PersonID": "bcL1kLAxuamcFJ1WtQiEeg",
            "PersonURLpart": "/user_details?userid=bcL1kLAxuamcFJ1WtQiEeg",
            "PersonName": "Mackenzie M.",
            "ReviewDate": "2021-06-08",
            "Rating": 5,
            "ReviewText": " Easy 5 stars. Never liked the dentist but when I stepped foot into this office Tame Impala was playing and I was instantly more relaxed. From the quick paperless check in to the legit 7 minute painless cleaning, the customer service was on point and made me feel comfortable. My jaw pain and crooked tooth always bothered me and they presented an easy, affordable solution and answered all my questions. Within 3 weeks my smile will be perfect and jaw issue gone. Ive never been to an office that was so high tech and helpful with my issues. Shout our Dr Gaj - best dentist out there. His taste in music is ok too"
        },
        {
            "PersonID": "36SgnVIq3Ys0IahA-4sGUQ",
            "PersonURLpart": "/user_details?userid=36SgnVIq3Ys0IahA-4sGUQ",
            "PersonName": "Michael L.",
            "ReviewDate": "2019-06-05",
            "Rating": 1,
            "ReviewText": " Shady is the one word I would use to describe this place. They overcharged my wife without her consent, using a picture of my credit card without my permission, for future procedures she hadn't confirmed were happening (for both of us, not just her), blamed us, scheduled the appointments and when I showed up for one of them said they gave the appointment to someone else because I didn't confirm by phone or text within 24 hours. The problem is that I received a text two hours before my appointment literally reminding me that I had that appointment and to show up for it, not asking for confirmation. They have continually acted with disrespect for us as customers in terms of our time, money and even applicable local laws, and we will not be going there any more. A shady experience all around - avoid at all costs."
        },
        {
            "PersonID": "XlrYi2js3O7iUrNPE6wFmQ",
            "PersonURLpart": "/user_details?userid=XlrYi2js3O7iUrNPE6wFmQ",
            "PersonName": "Victoria H.",
            "ReviewDate": "2017-08-20",
            "Rating": 5,
            "ReviewText": " Let me preface by saying I have extremely high standards for my dentist experience. Years ago, I had one dental office that set the bar, and after moving from city to city, no one has even come remotely close...except Enamel! Dr. C is an absolute GEM! He's personable, friendly, and extremely knowledgeable. Usually, you might see the dentist for 2 seconds at the end of a cleaning, but Dr. C. took his time with visually walking me through my x-rays, talking to me about my concerns and making me feel completely at ease. I had some cavities between my teeth that needed filled, and I'm not going to lie...it was an intense process, but Dr. C. made sure I was comfortable and made it as quick and tolerable as possible. Aside from the top notch actual dentistry aspect, they have an awesome office, Rokus with Netflix in every room, a \"smile menu\" with things like WINE and BEER, scented warm towels, neck pillows, etc. This is the experience that everyone should have in any kind of medical/dental office - it makes it more bearable (dare I say...fun?!) and it makes you feel like you're a priority and not just a patient. Something to take the edge off..."
        },
        {
            "PersonID": "Oa3DJUVl7M4V2eqtkf5riw",
            "PersonURLpart": "/user_details?userid=Oa3DJUVl7M4V2eqtkf5riw",
            "PersonName": "Don E.",
            "ReviewDate": "2020-06-10",
            "Rating": 1,
            "ReviewText": " This place is great for cleanings, well I assume they can handle that. I didn't let them do my cleaning after I had some issues with a broken crown. I went in pre quarantine for a cleaning. The doctor said that I had a cavity and need a crown immediately. He said it was urgent so I asked him if it would be best to wait until we saw what was happening with covid due to possible infections. He said it was urgent so I decided to do it. During the procedure he was typing on his computer with his gloves on and putting his hands in my mouth. I had to tell him that was nasty af. We continued with the treatment and got a temporary crown put in.I was scheduled to go back 2 weeks later to get my real crown put in and then they cancelled my appointment due to the lockdown. Which I knew would happen but my doctor insisted that they would be open. They are essential. Nope. I had a temporary crown in my mouth for a total of 7 weeks. The crown was molded by their entry level tech guy so when he fit the temporary crown it broke in my mouth at their office. He just added some paste and said it would hold for now. The whole experience was just horrible. I went to them because I live within walking distance, I have never had a bad experience with a dentist before so this was my first. I would let them do cleanings but I highly recommend to go to a different dentist for anything else. I was fine waiting for them to reopen during the quarantine, I get it. Global pandemic and all. But their staff handled my treatment poorly. Not once did they check in, there was no urgency on their end. They didn't care about my treatment at all. It was just a few grab for them. They wanted to make sure I got the treatment done regardless of any impact on my health. That was apparent when the dentist was using the same gloves he was typing with as he was in my mouth."
        },
        {
            "PersonID": "PNEXCs8vIwve0BNJmmqHkQ",
            "PersonURLpart": "/user_details?userid=PNEXCs8vIwve0BNJmmqHkQ",
            "PersonName": "Mark A.",
            "ReviewDate": "2020-06-04",
            "Rating": 5,
            "ReviewText": " I must be the only person I know who hasn't ever had a bad experience at the dentist. That being said, this has been my favorite, having lived in several cities. The staff is friendly and there are multiple reminders about the appointments. The office did have flat screens with Hulu/Netflix but I suspect remotes are banned for the time being. Dr. C is very concerned about his work and did a very thorough follow up to my crown that quickly resolved an issue I was having. Only bit of advice to the owners is to consider the aesthetics of the floor baseboard, the concrete seems to be a bit rough in places and could make it hard to clean going forward."
        },
        {
            "PersonID": "tI36Z-WgVc0_8Wgw6aRSSg",
            "PersonURLpart": "/user_details?userid=tI36Z-WgVc0_8Wgw6aRSSg",
            "PersonName": "Summer H.",
            "ReviewDate": "2020-09-24",
            "Rating": 5,
            "ReviewText": " I've trusted Dr. Patel with my oral care for about 4 years now. What I like is that they are friendly, clean, reasonably priced and do quality work!"
        },
        {
            "PersonID": "N0AcXbuOkR-iLgs82970Jw",
            "PersonURLpart": "/user_details?userid=N0AcXbuOkR-iLgs82970Jw",
            "PersonName": "Kat M.",
            "ReviewDate": "2018-09-09",
            "Rating": 2,
            "ReviewText": " One of my fillings fell out and I found this dentist office through Yelp. My first impression was that the office had just opened. The X-ray machine is in the front and there were empty tv boxes in a few of the rooms. The woman who took the photos of my teeth kept catching the camera on the back of my teeth as she yanked it out of my mouth. Surprisingly though, the office has been open for 3 years. The other thing that I really didn't like is that if you don't confirm your appointment, they cancel it. I got 2 voicemails on Thursday saying if I didn't confirm my appointment by noon Friday, they'd cancel the appointment. I didn't listen to them until late Friday but they didn't even give me 24 hours notice. I got the text message on Saturday asking me to confirm so I did and thought everything was ok. Come Monday, I found out that my appointment had still been cancelled. My doctor, gyno, hair stylist, and everyone else charges fees if you miss an appointment but they don't cancel it if you don't confirm....The last straw was the pricing. After insurance, my cost for everything would have been $2200 and that was in-network costs. I went to a second office to price check and for the exact same plan, the second office charged me less than $1000. The dentist was nice and informative but he's not worth going back to this office."
        },
        {
            "PersonID": "7jWhpt7lKd70VmrxmTJpCQ",
            "PersonURLpart": "/user_details?userid=7jWhpt7lKd70VmrxmTJpCQ",
            "PersonName": "Larry R.",
            "ReviewDate": "2018-11-19",
            "Rating": 5,
            "ReviewText": " Enamel's staff is super friendly and helpful. The dentists are young, recently trained, and are very thorough. Even when I've needed some extensive work, I've felt like I was in good hands. This seems like a newer dental practice; their equipment is of recent vintage, and they are up on the latest tech. I recommend them without reservation. Also, easy free parking in the garage behind the building. :-)"
        },
        {
            "PersonID": "Zq43TxiHbntLH-Qje_8H0A",
            "PersonURLpart": "/user_details?userid=Zq43TxiHbntLH-Qje_8H0A",
            "PersonName": "Casey F.",
            "ReviewDate": "2018-04-24",
            "Rating": 3,
            "ReviewText": " Let me start by saying everyone at Enamel is super friendly and personable - the service was great.  However, I think my dentist may be a little inexperienced.  At the end of my last appointment I was left super freaked out because Dr. C found some sort of mass above my back molars and referred me to a oral surgeon.  I was totally freaked out for weeks (it takes two weeks to get into the surgeon)! The oral surgeon looked at me like I was crazy - he literally referred you FOR THIS?!  It was tori, which is super common and basically explained that any dentist should know what tori looks like. She was shocked. Anyway, I feel like I wasted a ton of time, money, and worry on something that should have been in dentistry 101. It was pretty embarrassing."
        },
        {
            "PersonID": "S38RbVX081w1y3AFKHCL4w",
            "PersonURLpart": "/user_details?userid=S38RbVX081w1y3AFKHCL4w",
            "PersonName": "Suchita T.",
            "ReviewDate": "2017-12-28",
            "Rating": 3,
            "ReviewText": " I would say, first visit was good as the nurse was good and experienced. Second visit was with a new nurse and she wasn't confident about what she is doing and seemed kind of scared. I don't want someone to try their skill on my jaw especially when I'm suffering from a severe jaw pain. Doc suggested a night guard for the pain and guess what they forgot to take the impressions. I realized it in the parking lot so, had to go back in again. Now, third visit - the night guard. It wasn't a perfect fit so, Dr. Hardik did some adjustments. The weirdest thing - he didn't clean it well before letting me try it again and again (and I asked him to clean it more than twice). All the acrylic particles in my mouth, it was GROSS!! It wasn't clean when even they handed it to me. And I'm charged me $50 more for the night guard than what they told me before. I wish they had cleared it with me beforehand. Overall, it's a very typical business facility where they would be very nice on your first visit and after that they don't care much.Updates - My last visit was really good with Dr. Hardik. He adjusted the night guard so it feels better now."
        },
        {
            "PersonID": "TPL-kpF26yhIn_VLk-Xoaw",
            "PersonURLpart": "/user_details?userid=TPL-kpF26yhIn_VLk-Xoaw",
            "PersonName": "Ed S.",
            "ReviewDate": "2018-06-01",
            "Rating": 5,
            "ReviewText": " How often do you hear the word \"awesome\" associated with a dentist?This office does everything right: friendly staff, informative dentist (Dr. Patel), modern facilities, perks like Roku and a free water bottle.I have only one suggestion: foot massage."
        },
        {
            "PersonID": "aBSBT8dggFKqEyiF0_hxAQ",
            "PersonURLpart": "/user_details?userid=aBSBT8dggFKqEyiF0_hxAQ",
            "PersonName": "Joe N.",
            "ReviewDate": "2018-05-15",
            "Rating": 5,
            "ReviewText": " This is the best dentist experience I have been a part of.  The facility has TV's is very clean, and the dentist does the actual cleaning.  They are very nice, and really make my last dentist for the past 6 years look so bad.Do your teeth a favor and make Enamel Dentistry your dentist!"
        },
        {
            "PersonID": "MdCtiw7dEl9WU-eY-iKfuw",
            "PersonURLpart": "/user_details?userid=MdCtiw7dEl9WU-eY-iKfuw",
            "PersonName": "Alfredo Y.",
            "ReviewDate": "2020-02-12",
            "Rating": 5,
            "ReviewText": " Hands down, bar none the BEST dentist I have ever had in my life. Dr. Dillon Patel does fantastic work and is a pleasure to be around (P.S. I've never been a fan of the dentist)! The rest of the staff on site is also very friendly and made my whole experience seamless, enjoyable, and positive. I had 2 permanent crowns put in with no pain at all. Thank you. Thank you. Thank you. I am so happy right now!"
        },
        {
            "PersonID": "KY3Vq0852GUuNDynN88mwA",
            "PersonURLpart": "/user_details?userid=KY3Vq0852GUuNDynN88mwA",
            "PersonName": "Courtney M.",
            "ReviewDate": "2019-03-05",
            "Rating": 1,
            "ReviewText": " Worst cleaning ever by temp hygienist!!! Thought Dr Patel would make things RIGHT and give me a FULL CLEANING!  This was a sorry experience. Lost a customer, won't be back and certainly won't recommend!! Dr. Patel rocks the house!  I'm soooooo happy with my new crown.  It's my first and I want another one! ha!  Thanks Dr. Patel for just being awesome and brilliant.  I'm super picky and he exceeded my expectations. I feel like my new zirconium tooth is heavy duty allowing me  to eat lots of stuff quickly!  Brittney was such a sweetheart too, she answered all of my questions and concerns and most importantly kept me calm.  The lady that checks you in is super cool too.  Love the space, love the people, experience the Enamel Dentistry difference! :) Read more"
        },
        {
            "PersonID": "9eo3Yi45LxtItaQSDkAq-A",
            "PersonURLpart": "/user_details?userid=9eo3Yi45LxtItaQSDkAq-A",
            "PersonName": "Rafael F.",
            "ReviewDate": "2018-01-10",
            "Rating": 5,
            "ReviewText": " Dr. Patel and his assistants were amazing. I came in based on a review from a coworker. Their work ethic and execution was flawless. The sole purpose of my visit was to consult on 2 cavities, and Dr. Patel was very comforting on the plan he had in mind. Within 45-1 hour I was ready to go. Like he said \"instant gratification.\" It's been 3 days since my surgery and I have no pain or discomfort, the sutures feel great and they don't move around when I drink or eat. Thank you guys!"
        },
        {
            "PersonID": "aFom_f2Yjd2aGL0bW2QMWw",
            "PersonURLpart": "/user_details?userid=aFom_f2Yjd2aGL0bW2QMWw",
            "PersonName": "Jacques B.",
            "ReviewDate": "2017-06-19",
            "Rating": 5,
            "ReviewText": " Excellent front desk customer service! I thought they were joking when they were offering to drink wine or beer...actually true. Very clean and modern facility. The staff and dentist were friendly and very detailed orienatated"
        },
        {
            "PersonID": "WOtXrDzVtd5kl5EmPeS6mA",
            "PersonURLpart": "/user_details?userid=WOtXrDzVtd5kl5EmPeS6mA",
            "PersonName": "Austin X.",
            "ReviewDate": "2017-10-19",
            "Rating": 5,
            "ReviewText": " These guys are friggin' rockstars.  The office is welcoming and comfortable, appointments are on time, and the dentists are extremely thorough.  I hope they never change their business model because I love all the personalized attention.  My spouse and I both started coming here and I am so glad we did.  Did I mention the comfort menu and Netflix on demand.... go check it out for yourself.  Office staff- 5 stars.  Loved seeing my treatment plan in advance and a breakdown of all the costs.Office decor and cleanliness - 5 starsDoctors- 5 stars.  Extremely thorough and patient."
        },
        {
            "PersonID": "siCXCfoNEZLTZhexqLiGKA",
            "PersonURLpart": "/user_details?userid=siCXCfoNEZLTZhexqLiGKA",
            "PersonName": "Alexander W.",
            "ReviewDate": "2018-04-27",
            "Rating": 5,
            "ReviewText": " I highly recommend Enamel Dentistry for cleanings and dental work. Dr. C and his staff were very professional and knowledgeable. They don't push for dental work that is unnecessary (as I have experienced in the past) and their prices are reasonable. The office environment is welcoming and comfortable. I had a cleaning and fillings done and am very satisfied with the results. If you are looking for a more millennial-friendly atmosphere,  look no further."
        },
        {
            "PersonID": "sBlgxZC7sgyMEha0xjAT8w",
            "PersonURLpart": "/user_details?userid=sBlgxZC7sgyMEha0xjAT8w",
            "PersonName": "Jason b.",
            "ReviewDate": "2017-06-14",
            "Rating": 5,
            "ReviewText": " No complaints from me (Which is saying a lot as the dentist is about my least favorite place in the world.)The office is nice, you have TV you can watch while they do their work which helps take your mind off of the sounds that are the worst part of a dentist office. I also had to have a cavity filled and it was great, no pain and he asked specifically what I need to make it better. Overall, recommended if you are looking for a new dentist."
        },
        {
            "PersonID": "njvz_tw9z6pcxN25x5R53g",
            "PersonURLpart": "/user_details?userid=njvz_tw9z6pcxN25x5R53g",
            "PersonName": "Lorrie C.",
            "ReviewDate": "2017-07-20",
            "Rating": 5,
            "ReviewText": " This is the first dentist I've been to in my unfortunate dental history who didn't seem like an alien doing their very best to imitate human behavior and mannerisms. The desk staff were friendly and helpful, the office was so up to date my mind was a little blown by all the new technology that happened in the 3 years since I'd been to the dentist. The cleaning didn't take forever and the x rays were soooo fast, I was in and out of there in about an hour and that was WITH having one cavity filled. Also their parking is in a garage, which means SHADE. Customer for life right here."
        },
        {
            "PersonID": "TcrqXWQfVTMf_72OB_LYfg",
            "PersonURLpart": "/user_details?userid=TcrqXWQfVTMf_72OB_LYfg",
            "PersonName": "Kearstyn T.",
            "ReviewDate": "2017-05-16",
            "Rating": 5,
            "ReviewText": " I was super anxious going in for my appointment today because it had been a while since I'd gone to the dentist and I've been having some issues with my gums. I had nothing to worry about, though, because everyone on staff was so nice and reassuring! The dental hygienist and Dr. Patel took the time to explain step by step what they were doing, which went a long way in alleviating the nervousness I felt when I walked in.I also appreciate how attentive the staff was. Even though my appointment was at the end of the day, everyone was just as thorough and patient as if it had been at the beginning of the day. Every person I interacted with checked in with me to find out if I had questions or concerns and seemed genuinely interested in making sure I had a good experience.  Thanks so much, y'all, for being great at what you do! I will definitely be back."
        },
        {
            "PersonID": "7rPfmiBWqIRkt_rHF0szgg",
            "PersonURLpart": "/user_details?userid=7rPfmiBWqIRkt_rHF0szgg",
            "PersonName": "Lorena R.",
            "ReviewDate": "2017-02-14",
            "Rating": 5,
            "ReviewText": " I really needed a cleaning and my dentists said they couldn't see me for two months. I called up Enamel because I'd heard good things from my coworker. They were able to see me the same day and took my insurance. Score!The office is really nice and contemporary. Everything's brand new and state of the art. Netflix availability in the chair was a big plus of course as were the drink offerings I didn't partake in. The staff all were friendly and professional.The doctor was obviously very knowledgeable and candid which I like. I could tell he was telling me the real deal and not trying to scare or upsell me. There's plenty of parking in the garage and next to the complex the office is in, a huge plus in Austin!Looking forward to enamel being my new dentist office."
        },
        {
            "PersonID": "BfqpU0An-H4kNpxc-tyyog",
            "PersonURLpart": "/user_details?userid=BfqpU0An-H4kNpxc-tyyog",
            "PersonName": "Joseph D.",
            "ReviewDate": "2020-08-03",
            "Rating": 1,
            "ReviewText": " Went to this location to get dental work done before my wedding. Agreed on the cost BEFORE the procedures. After multiple visits to get work completed, I get a call saying they want more money. Once I refused they have since sent me to collections. There are better dental practices in Austin that aren't shady like this group."
        },
        {
            "PersonID": "vGhaSYOuSGJ8_gbHYVe8IA",
            "PersonURLpart": "/user_details?userid=vGhaSYOuSGJ8_gbHYVe8IA",
            "PersonName": "Courtney H.",
            "ReviewDate": "2018-02-16",
            "Rating": 5,
            "ReviewText": " Dr. C and his staff are amazing! I came in knowing I needed a little bit of work done and I was blown away at how awesome everyone here was. From the front office to the back everyone treated me like a human which is sometimes hard to come by in the medical/dental world. I worked in the dental field for a few years so I have high expectations and am happy to say that Enamel Dentistry exceeded all of those expectations! I ended up completing all of my treatment and am feeling great. The office is very modern and comfortable. I really can't say enough about the people working here, thanks for everything. So glad that I have found my dental home :)"
        },
        {
            "PersonID": "8ZScCykOkw3yHorNkKMIWg",
            "PersonURLpart": "/user_details?userid=8ZScCykOkw3yHorNkKMIWg",
            "PersonName": "Joe T.",
            "ReviewDate": "2017-04-05",
            "Rating": 5,
            "ReviewText": " Have not been to the dentist in about 6 plus years.As soon as I walked in I felt extremely comfortable.The small waiting lobby is very homey and comfortable. Front desk lady is extremely sweet and nice, except she does not like Houston what so ever. Offered to give me a new york hat instead. Lol.Dr. C as he likes to be called is great. Put my mind at ease with my check up and deep cleaning. Every little bit would ask if I was ok. Took the time to talk to me and get to know a little about me and remembered details about me. I have never had a cleaning so intense and thorough.Loved the proactive texting about my upcoming appointments. Very glad I found them on YELP. I highly recommend them for your dental needs.BTW, they give you a beer for 2 Smiles."
        },
        {
            "PersonID": "LLs9967TVlT1CeVWrcbEiQ",
            "PersonURLpart": "/user_details?userid=LLs9967TVlT1CeVWrcbEiQ",
            "PersonName": "Mardo I.",
            "ReviewDate": "2017-05-31",
            "Rating": 5,
            "ReviewText": " Excellent service by both the staff and the doctor. Each took the time to explain procedures in detail and to go over the health of my teeth and gums. They have Netflix in every room and they also offer free water and drinks as well as a warm pillow! Highly recommend them!"
        },
        {
            "PersonID": "OLVy4qLnodbhXxGp1BjFZw",
            "PersonURLpart": "/user_details?userid=OLVy4qLnodbhXxGp1BjFZw",
            "PersonName": "Chexty T.",
            "ReviewDate": "2016-09-14",
            "Rating": 5,
            "ReviewText": " I've had dates that weren't as comfortable as my root canal. Dr. C and the whole team were professional, fun, and made the whole experience not suck. I was hesitant to make an appointment because I thought this might just be another tooth whitening, cosmetic doc in a box that you see popping up all over Austin. The guys (and gal) have the skills to take care of damn near anything. As a man who has avoided going the dentist like the plague for years I can't recommend them enough. They will fight to make sure insurance actually covers their part and they don't try to hard sell you on expensive elective procedures. Not to mention free beer and all the Netflix you can binge! Root canal and chill."
        },
        {
            "PersonID": "iBi_7jiH7KcbI_ef33yezQ",
            "PersonURLpart": "/user_details?userid=iBi_7jiH7KcbI_ef33yezQ",
            "PersonName": "Dani D.",
            "ReviewDate": "2017-11-16",
            "Rating": 5,
            "ReviewText": " I'll update once the Novocain wears off but, after the first half of an emergency root canal, my experience at Enamel Dentistry is worth at least six stars.  I was minding my own business snarfing some mixed nuts for a snack when a walnut viciously, and quite possibly with malice aforethought attacked, one of my molars.  The walnut was defeated but not without cost....a chunk of the molar cracked off. Ow. Ow. All the OW!I called and the nice folks at Enamel set me up with an appointment with Dr. Patel for the following day.  Online new patient paperwork was breeze and there were only two things for me to sign when I checked in for my appointment.  There was no wait and, though I was legitimately terrified, Dr. Patel and the rest of the staff did a great job putting me at ease by explaining each step of the diagnostic exam and the treatment plan."
        },
        {
            "PersonID": "-EBD2Uw968d_R3EalOGzHw",
            "PersonURLpart": "/user_details?userid=-EBD2Uw968d_R3EalOGzHw",
            "PersonName": "Molly K.",
            "ReviewDate": "2019-02-04",
            "Rating": 5,
            "ReviewText": " Best dentist I've ever been to and I normally hate going to the dentist. Every person in their office is smiling and clearly loves working there. The staff at Enamel (Dr. Patel, Anthony, Zuri & Allie) made my experience pleasant and took the time to walk me through each step while educating me on why they were doing certain things. They didn't try to upsell me on anything, but offered advice on how to keep my teeth healthy and bright. They gave me a toothbrush, toothpaste and water bottle to take with me. I even got to watch Netflix to distract myself from the stuff I don't enjoy about dental cleanings. Would highly recommend to anyone looking for a great dentist. Business owner information Hardik C. Business Owner 2/4/2019 Molly,Thank you so much for your awesome review!!! We do try hard to make sure all of our patients know why we are doing the things that we do, it’s what keeps us going!Dr. Devish Patel and Dr. Hardik Chodavadia Read more"
        },
        {
            "PersonID": "28fjhv15qDeGj6EwmR5woA",
            "PersonURLpart": "/user_details?userid=28fjhv15qDeGj6EwmR5woA",
            "PersonName": "Brittany M.",
            "ReviewDate": "2017-12-06",
            "Rating": 5,
            "ReviewText": " Amazing dentist, staff and office! I promise you won't be disappointed. My fiancé and I both go here and we recommend it to everyone."
        },
        {
            "PersonID": "NhbN4yGeCHRRRl8dV725gw",
            "PersonURLpart": "/user_details?userid=NhbN4yGeCHRRRl8dV725gw",
            "PersonName": "Dacia W.",
            "ReviewDate": "2019-01-08",
            "Rating": 5,
            "ReviewText": " I had my new patient visit today at Enamel. I recently moved to Austin from Oregon and chose Enamel after my boyfriend had a great first experience there. I was welcomed into the office with a tour and friendly smiles everywhere. Dr. C as well as the entire staff was welcoming and friendly. I felt comfortable throughout my cleaning and appreciated the explanations of all the newest technology by Dr. C. I'll be back! Business owner information Hardik C. Business Owner 1/28/2019 Dacia,Thank you so much for your kind words!! We try and do our best and I’m glad you had a great experience- see you again soon!Dr. Hardik Chodavadia Read more"
        },
        {
            "PersonID": "O16tKJ9C_gXIGmM3yjErpQ",
            "PersonURLpart": "/user_details?userid=O16tKJ9C_gXIGmM3yjErpQ",
            "PersonName": "Patrick C.",
            "ReviewDate": "2018-05-15",
            "Rating": 5,
            "ReviewText": " Incredible service from top to bottom!Very diligent & thorough in explaining what needed to be addressed, helping one prioritize with ease.Staff was impeccably good in breaking down prices - procedures.Amply recommend it!"
        },
        {
            "PersonID": "QAIMS4HG6pn1ZCMtgUuGeA",
            "PersonURLpart": "/user_details?userid=QAIMS4HG6pn1ZCMtgUuGeA",
            "PersonName": "Sweta V.",
            "ReviewDate": "2017-01-12",
            "Rating": 5,
            "ReviewText": " I had my first experience with Enamel Dentistry yesterday and I couldn't be more happy. Highlights:Paperless check-in.Natural lighting and open layout (less claustrophobic than most offices).Full tour of the facility and thorough explanation of procedures.Perks including watching TV and beverages.Genuine interest in dental needs and personal attention.Overall, Dr. C and his staff are professional and thoughtful. For once I'm looking forward to my next dentist appointment!"
        },
        {
            "PersonID": "MZEF14KEdiHSV4XRX5ySWQ",
            "PersonURLpart": "/user_details?userid=MZEF14KEdiHSV4XRX5ySWQ",
            "PersonName": "Rebekah R.",
            "ReviewDate": "2019-12-08",
            "Rating": 5,
            "ReviewText": " I've never liked going to any dental office until I visited Dr. C at Enamel. Everyone makes you feel so welcome as soon as you arrive, & Dr. C is pretty cool. He explains everything in terms that you can understand (which I appreciate!) & makes sure that he answers every question you have. The office has the most comfortable dental chairs that make it so easy for you to relax while watching your favorite series. Even their art is one of a kind and definitely a conversation starter. Everyone that visits would agree that Enamel has superb customer service, a laid back, unpretentious vibe with every modern convenience. Congrats, Enamel Team for creating something Austin had not seen before but was definitely needed!"
        },
        {
            "PersonID": "KWq_8FvJ5Dfrb8tjJLZMIw",
            "PersonURLpart": "/user_details?userid=KWq_8FvJ5Dfrb8tjJLZMIw",
            "PersonName": "Madison B.",
            "ReviewDate": "2019-09-03",
            "Rating": 5,
            "ReviewText": " This dentist is the absolute best.  Beverage options, netflix, and good vibes. Doesnt get better"
        },
        {
            "PersonID": "CBFlddcZo13qeX23GTk7Dg",
            "PersonURLpart": "/user_details?userid=CBFlddcZo13qeX23GTk7Dg",
            "PersonName": "Mallory K.",
            "ReviewDate": "2020-09-23",
            "Rating": 5,
            "ReviewText": " Love love love this place. Everyone was super friendly & Dr Dillon Patel was very knowledgeable & helpful. Rob at the front was also very kind & helpful with providing information about payment options etc. Clean & updated facility. VERY ORGANIZED."
        },
        {
            "PersonID": "Idjkh78suPL3JVJquliuFg",
            "PersonURLpart": "/user_details?userid=Idjkh78suPL3JVJquliuFg",
            "PersonName": "Matt B.",
            "ReviewDate": "2016-07-31",
            "Rating": 5,
            "ReviewText": " Called this dentist office on a whim (they're down the street from me) after chipping my tooth and was able to make it in as a new patient same day.  The dentists (I see Dr. C) and office staff couldn't be nicer, and as a brand new office they have put a lot of thought into the patient experience - I'm sure you'll see other references to their patient comfort \"menu\" which includes neck pillows, headsets for the Netflix-equipped tv's, and even beer (haven't taken them up on that yet).While the amenities are much appreciated, my teeth are of course my priority.  After a really good job on the chip (front tooth so I was a bit self-conscious about how it would turn out) I decided to switch from my previous dentist altogether for a crown I'd already had planned, and the visits have been noticeably easier than I'd been used to.  The Dr also called me directly the day after to check-in and provide his direct contact number in case I had any pain or issues - no problems at all so far.Happy to have found a dentist's office I really like after moving around over the years, and have referred my friends and girlfriend.  Happy to give them a thumbs up and recommend to anyone who just moved to town or looking for a change."
        },
        {
            "PersonID": "PVbq7z0Ym-h3-UGb7Hl5_Q",
            "PersonURLpart": "/user_details?userid=PVbq7z0Ym-h3-UGb7Hl5_Q",
            "PersonName": "Katharine F.",
            "ReviewDate": "2016-07-19",
            "Rating": 5,
            "ReviewText": " Can a dentist's office be hip(ster)? I think Enamel Dentistry is! As mentioned in another post, Enamel is located in the '04, practically next to Matt's El Rancho and Soup Peddler, so already winning bonus points there. Additionally, they offer beverages upon entering the office, which are all free (ok, paid with a smile)! Plus, they have cool \"bad boy\" President and famous persons paintings, which decorate the hallways of their office. AND, as a new office, they're currently raffling prizes to new patients. I had my first appointment at Enamel Dentistry yesterday, and as much as I don't like going to the dentist, the staff made me so comfortable even before I arrived. I spoke with Dr. Chodavadia (Dr. C) on the phone a few times before coming in, and even though I had to change my appointment twice, he just laughed and joked with me and never got annoyed. Also, I was surprised that Dr. C did my dental cleaning and not an assistant. That was pretty cool, as typically, other dentists spend about two seconds talking about my teeth after the cleaning. I wouldn't say the cleaning itself was enjoyable (I've learned I don't love visiting the dentist), but Dr. C tried to make sure I was comfortable and would briefly stop and check in to make sure I was okay during the cleaning. He also thoroughly went over my X-rays.I think what I especially loved is that Enamel was never trying to \"sell\" me anything. They didn't swish my mouth with fluoride (and then request $20 payment), nor did they give me the Invisalign or braces schpeel, even though I probably need it. Finally, their prices are incredible, and they have a crazy inexpensive family plan. Check them out on SoLa!"
        },
        {
            "PersonID": "rlpIntlb7FqU7T87MZCP3A",
            "PersonURLpart": "/user_details?userid=rlpIntlb7FqU7T87MZCP3A",
            "PersonName": "Paige P.",
            "ReviewDate": "2016-08-18",
            "Rating": 5,
            "ReviewText": " I loved everything about Enamel! The staff was so friendly, and the office was so clean and inviting! The dr. went through and explain everything throughly which made me feel so comfortable. I plan on recommending enamel dentistry to all of my friends and co-workers!!"
        },
        {
            "PersonID": "w48RBbopAZ6Gl2GbEcRmDg",
            "PersonURLpart": "/user_details?userid=w48RBbopAZ6Gl2GbEcRmDg",
            "PersonName": "Neha M.",
            "ReviewDate": "2016-05-18",
            "Rating": 5,
            "ReviewText": " I never thought I'd be comparing a trip to the dentist with a day at the spa, but Enamel has really hit it out of the park. First off, making the appointment was super easy through their online scheduler. They even sent me my forms via email so I wouldn't have to sit and puzzle over them in the office- what a time-saver! When I walked into the office, I was greeted by a friendly receptionist, a complimentary beverage menu (yes, there's wine and beer here!), and a TV with Roku to let me continue my Netflix-binge tendencies in the waiting room.I was given a tour of the office by the dental assistant (love the purple accents) and then a full X-Ray/imaging workup was done. Dr. Patel was very friendly and knowledgeable about his craft. The seats were comfy, the TV was great, and he was even able to pull up my X-Rays on the giant screen so I'd be able to look at them with him without craning my neck. Dr. Patel was extremely thorough in examining my teeth and discussed a few options with me for further care. I'll definitely be coming back in a few weeks to continue my treatment plan.After my cleaning, I was given a warm, lavender-scented towel to wash up. Spa, I tell you! They also give great goody-bags so I'm sold. Keep doing what you're doing, Enamel! (but not so much that I can never get an appointment) :)"
        },
        {
            "PersonID": "4_6_z26vnFXiSWWCHSb80A",
            "PersonURLpart": "/user_details?userid=4_6_z26vnFXiSWWCHSb80A",
            "PersonName": "Katie G.",
            "ReviewDate": "2016-06-30",
            "Rating": 5,
            "ReviewText": " The dentists at Enamel were so friendly and made me feel very at ease. They were very professional and I felt like I was in good hands. All the high tech gadgets and little touches were cool too--loved the Netflix!! They even offer you wine when you come in :) not dreading my next dentist appointment this time!!"
        },
        {
            "PersonID": "pN5jC87hTUKmdsCs5vc9lw",
            "PersonURLpart": "/user_details?userid=pN5jC87hTUKmdsCs5vc9lw",
            "PersonName": "Jennifer M.",
            "ReviewDate": "2017-02-20",
            "Rating": 5,
            "ReviewText": " Great staff. State of the art tools making your time there quick and painless. Let me watch Netflix while cleaning my teeth ;) Double date!"
        },
        {
            "PersonID": "Thduo8kSw7lueCrYUen56Q",
            "PersonURLpart": "/user_details?userid=Thduo8kSw7lueCrYUen56Q",
            "PersonName": "Mariana P.",
            "ReviewDate": "2020-03-09",
            "Rating": 5,
            "ReviewText": " Enamel Dentistry continues to be the best dental experience I've ever had. I used to dread going to the dentist, but Dr. Devish Patel and his team make every effort to make my appointment as relaxing as possible. I can tell he genuinely cares about my dental wellbeing. He is very thorough and he emphasizes preventative care above all else in a very non-judgmental manner. Their office is equipped with state of the art equipment and I found the staff to be extremely friendly and professional. I've never had any issues with the billing process. I now live in San Antonio and I still make the drive to come see him because he's worth it."
        },
        {
            "PersonID": "tRkygj86UZaKS_ef8zZb-A",
            "PersonURLpart": "/user_details?userid=tRkygj86UZaKS_ef8zZb-A",
            "PersonName": "Devin H.",
            "ReviewDate": "2019-07-09",
            "Rating": 5,
            "ReviewText": " I hadn't been to the dentist in at least a decade... I was scared to go to a dentist for the obvious reasons but also because I assumed I would be \"sold\" services I didn't need. I may have trust issues. Anyway, Dr. Patel was awesome. I had complete confidence in everything he said and did. Long story short, he could have easily sold me more fillings if he had wanted to line his wallet. He didn't try and actually told me why he recommended not doing additional work... I found my new dentist and am happy to have my next appointment prescheduled for 6 months from now. My wife also went to enamel but saw dr. C. She was equally happy with him."
        },
        {
            "PersonID": "NKHHuTpdJ-ZNPCHMhhzLWA",
            "PersonURLpart": "/user_details?userid=NKHHuTpdJ-ZNPCHMhhzLWA",
            "PersonName": "Sandeep S.",
            "ReviewDate": "2016-05-29",
            "Rating": 5,
            "ReviewText": " Enamel Dentistry is a new office that is located in one of the most attractive areas of Austin. The 78704 Lamar Zip Code is home to everything Austin, so it makes sense the best dentists also decide to open a new practice there!I was privileged to be one of first patients there, and any doubts I had of a new practice (I know we all get jitters when we decide to switch our providers!) were quickly gone. Dr. Patel & Dr. Chodavadia dedicate both of their efforts to make sure absolutely everything is going well. They will go out of their way to consult, exam, and target problem areas. They do not rush anything and can even suggest preventative care to make trips to the dentist less severe.Both dentists are extremely knowledgeable as well- I found this to be extremely important. I am someone who likes to pry and just keep asking questions, and they gracefully held quite a lengthy conversation with me on the practice of dental medicine. The maturity of this practice screams 20+ years of service. The office itself is beautiful. Alot of natural light, floor to ceiling windows- and great decor. You get a true lux feel, without the lux cost. They worked with my insurance, and even gave me a great special for their Grand Opening. I can confidently say this place cares more about quality than quantity. I would highly recommend this group to everyone, and those looking to switch away from corporate providers or poor quality dentistry. They are extremely flexible, worked with my schedule, and even offered early morning cleanings. (SO REFRESHING!)CHECK THEM OUT! I know i'll be back regularly for my cleanings!"
        },
        {
            "PersonID": "W9crPUUY9ZAo5Ivhsd1wSw",
            "PersonURLpart": "/user_details?userid=W9crPUUY9ZAo5Ivhsd1wSw",
            "PersonName": "Tricia B.",
            "ReviewDate": "2018-12-17",
            "Rating": 5,
            "ReviewText": " Phenomenal and fast service! Barely waited, staff and doctor all had great energy and were very attentive and explained all procedures. They used up to date technologies in their procedures and I even got to watch some Netflix while in the chair. I used to work in the dental industry and they definitely know their stuff. Highly recommend! Business owner information Hardik C. Business Owner 12/19/2018 Thank you so much for your kind words!!! We try and do our best for our patients, and it’s reviews like yours that keep us going!-Dr. Hardik Chodavadia Read more"
        },
        {
            "PersonID": "WiqL2BdVCa-Ymu-yP7XiMw",
            "PersonURLpart": "/user_details?userid=WiqL2BdVCa-Ymu-yP7XiMw",
            "PersonName": "Tommy G.",
            "ReviewDate": "2019-03-26",
            "Rating": 5,
            "ReviewText": " Dr  Patel is an excellent dentist in fact through the years he's the best I've been to. The price of the work was below that of other dentist. The office is well organized so there is never a long wait to be seen. You won't be disappointed."
        },
        {
            "PersonID": "I-nEYeRMaZy2zt60z-Yomg",
            "PersonURLpart": "/user_details?userid=I-nEYeRMaZy2zt60z-Yomg",
            "PersonName": "Nehal D.",
            "ReviewDate": "2016-05-19",
            "Rating": 5,
            "ReviewText": " One of my friends recommended me this place, so I took a chance to visit the Enamel Dentistry from my regular Floss Dental. In my opinion, Enamel Dentistry is brand-new have decentralized cumbersome dental visit experience. Types of equipment are top-notch, and quality of products and technology seems the state of the art. The team is relatively young, so they bring a positive aura of passion and commitment. This team wants to help you and being a patient that means a lot to me. Right from the warm homely greeting at the reception to choose one's favourite program on TV makes the overall experience gratifying. Before coming here, I knew that I had few cavities and a root canal issue underlying. Dr. Devish Patel and his team were professional to look into the recommendation from floss dental and advised me an excellent step-wise treatment plan to deal with all the issues. In my first visit only Team took care of all my cavities - I like their technology setup where they show you your panoramic x-ray and go over tooth by tooth to show you where exactly they are going to work and why the procedure is needed. Doctor took care of all my trivial questions, and I must say I never got such attention to the details ever before. My previous dentists were more interested in making money rather than helping me with troubleshooting my underlying issues. Moreover, Dr. Patel was so cool that I even added him on my facebook. I have shifted my regular cleaning visits from Floss to Enamel Dentistry. I would highly recommend this place to you Yelp readers. Furthermore, I sincerely wish this Dr. Patel and Dr. Chodavadia for the Enamel Dentistry."
        },
        {
            "PersonID": "SBwk2P9yP0ijjKUFDizZnA",
            "PersonURLpart": "/user_details?userid=SBwk2P9yP0ijjKUFDizZnA",
            "PersonName": "Sydney C.",
            "ReviewDate": "2018-07-12",
            "Rating": 5,
            "ReviewText": " Booking my appointment was pleasant and informative, getting checked in was easy and every person that I spoke to was polite and friendly. I never felt pressured to agree to additional treatments and the financial stuff was very clear. Plus, they offered different payment options--something that not a lot of dentists offer other than applying for credit. I haven't completed my entire procedure but so far, so good. I feel like I am in good hands and Dr. C made the experience as easy and comfortable as getting a crown can be. He was the only dentist when I went in but the team was working efficiently to get through the appointments. It never felt like my procedure was rushed though, and I appreciated that.The office itself is really nice. It was clean, modern-feeling, and all the other things a dentist's office should be (and then some). I like that everyone there seemed to really enjoy their job and that made me feel confident in their work. I recommend this place to anyone with or without insurance, and especially to anyone who is wary of the dentist in general."
        },
        {
            "PersonID": "4tgrD6QDLSq86c9NskOdIA",
            "PersonURLpart": "/user_details?userid=4tgrD6QDLSq86c9NskOdIA",
            "PersonName": "Austin R.",
            "ReviewDate": "2020-03-26",
            "Rating": 2,
            "ReviewText": " I liked the place until my filling came out and now everything I drink water it hurts. Originally went in to get some fillings and now everyone is closed and I'm stuck with this pain. I had to find another dentist across the city just to get it fixed since they're closed. I spent nearly $200, yeah not worth it :/ Business owner information Hardik C. Business Owner 3/26/2020 Andres R,So sorry to hear about what happened! I hopeYou have reached out to anyone on our team by phone or email!Under normal circumstances we would be with you immediately to get this taken care of at no charge obviously! Unfortunately due to the current COVID-19 crisis we have been mandated by law and decree of our governor that we only see patients with life threatening emergencies or things that would send people to the ER in order to curb the spread of this truly dangerous disease. We remain committed to the safety of our patients and team during these trying times. I encourage you to reach out directly to me via email : drharcho@enameldentistry… or use our virtual consult platform that we rolled out for this crisis on our website. We will get through all of this together! Look forward to hearing from you,Dr. Hardik ChodavadiaCo-Founder Read more"
        },
        {
            "PersonID": "2CrCO4R0jxPcsVw7Ao29Vg",
            "PersonURLpart": "/user_details?userid=2CrCO4R0jxPcsVw7Ao29Vg",
            "PersonName": "Greg J.",
            "ReviewDate": "2018-06-21",
            "Rating": 5,
            "ReviewText": " Best.Dentist.Ever. Seriously what else needs to be said after you see the rest of the reviews. How often do you say, man that was a good experience when visiting a dentist. Everything from when you walk in the door until you leave is a great friendly staff. Clean facility with lots of new neat gear. Dr C is beyond fantastic both in the way he interacts with you & just as important when he gets to work. I got a comprehensive plan for dental work and a team there I feel confident are great to see many times in the process. Check them out."
        },
        {
            "PersonID": "FBq6U93hJkFDP6wQDfFVkw",
            "PersonURLpart": "/user_details?userid=FBq6U93hJkFDP6wQDfFVkw",
            "PersonName": "Clint W.",
            "ReviewDate": "2018-02-22",
            "Rating": 5,
            "ReviewText": " We tried Enamel Dentistry based on all the good reviews.   We were not let down.   Dr. Patel was great- went over things that he suggested without trying to sell me on unnecessary procedures, etc.   All the technicians were also good.   The office is very nice, great location and they use cool new technology.   Oh, they also have a 'comfort' menu you can choose from- beer, wine, pillows, etc.   you can watch Netflix if you want also.   I highly recommend."
        },
        {
            "PersonID": "ol3mbm4gIxbV_r76zSKvRw",
            "PersonURLpart": "/user_details?userid=ol3mbm4gIxbV_r76zSKvRw",
            "PersonName": "Sugar S.",
            "ReviewDate": "2018-05-01",
            "Rating": 5,
            "ReviewText": " Awesome office. Very friendly and personable staff. Dr. C is great - takes a personal interest in clients and is meticulous!  They really think of the client experience - I love that they use warm water on their treatments, and offer a \"comfort menu\"!  Looking forward to going back."
        },
        {
            "PersonID": "GPdjk_sPxZ_jGh3tyWMHxQ",
            "PersonURLpart": "/user_details?userid=GPdjk_sPxZ_jGh3tyWMHxQ",
            "PersonName": "Lauren T.",
            "ReviewDate": "2016-10-18",
            "Rating": 5,
            "ReviewText": " I cannot recommend Dr. C and this team enough! I HATE the dentist-- so much so that I lived with a temporary crown for a year because I just could not go back and take another moment in that chair. I think I've written 1 Yelp review in my entire life but I happily make this addition to the roster.My molar broke and my temporary crown came off within days of each other and Dr. C got me in right away after I filled out the online request form. He took extra care to make sure I was comfortable, helped me avoid a root canal, and I watched Netflix the entire time. Afterward we put together a treatment plan to fix both of my crowns and fill some cavities. They were all super willing to work with my financial situation to make sure I got treatment without breaking the bank and they even helped me navigate some weird claims from my former dentist. Overall, I would say go here without hesitation. I have a few more visits left for my treatment plan and I'm actually looking forward to going!"
        },
        {
            "PersonID": "1bMAC3tQqYuN0JkIZRKVqQ",
            "PersonURLpart": "/user_details?userid=1bMAC3tQqYuN0JkIZRKVqQ",
            "PersonName": "Danielle W.",
            "ReviewDate": "2018-04-27",
            "Rating": 5,
            "ReviewText": " I really like this place.  I moved here 2 years ago and used yelp to try and find a dentist and had 2 pretty big disappointments but I gave yelp one last chance and it did not let me down - Enamel was fantastic.Scheduling of appointments was easy and with friendly service.Text reminders and filling out online forms was easy.  Everyone has a big smile in the office and was happy.The front desk person was very friendly and charismatic.I loved the details.... even their wifi password was something cute and dental related.  They have netflix and other tv options.The XRay person actually knew how to took a painless Xray -- (the other 2 places I tried were awful with the Xrays, but had no problems here)The dental technology seemed top notch.Dr. C spent a few minutes asking about me and was super friendly, nice and awesome.  I've haven't seen such a positive happy human being in a long time - he was fantastic.  The dental assistant and Dr. C kept asking if I was ok and were genuinely concerned the whole time how I was doing.  He showed me pics of my teeth on a big tv which was cool, I've never seen them with such magnification.  Also, and this is not to be taken lightly -- he did not try to do \"extras\" like rip out old fillings or try to sell me cosmetic whitening.....  the dentist I tried out last month did both.  You can tell by their busy office that they are doing well and patients are happy so they dont need to do unwanted and unnecessary dental items.   Very pleased."
        },
        {
            "PersonID": "VoawH3eHPRu5jGxDhDeiGw",
            "PersonURLpart": "/user_details?userid=VoawH3eHPRu5jGxDhDeiGw",
            "PersonName": "Brandie L.",
            "ReviewDate": "2018-05-31",
            "Rating": 5,
            "ReviewText": " I had a great experience at Enamel.  Everyone that worked there was extremely kind and informative. I didn't feel judged for waiting a while to come in and they took care to suggest only things that seemed necessary. No trying to up-sell or force unneeded dental procedures here! Also, the tv's with Netflix and wine/beer when you get in are a great extra touch that shows they are really trying to cater to the patients comfort.  I have already told everyone I work with they need to go to Enamel for all of their dental needs, so I thought it was time to sing there praises outside of my circle. It's a great spot and I'm happy to know I finally found my official Austin dentist!"
        },
        {
            "PersonID": "0Px91sDR-V-TFURFj8PcWA",
            "PersonURLpart": "/user_details?userid=0Px91sDR-V-TFURFj8PcWA",
            "PersonName": "Jennifer H.",
            "ReviewDate": "2018-02-08",
            "Rating": 5,
            "ReviewText": " Let's face it - no one wants to go to the dentist. You're willing to sacrifice usually one area though in order to have an overall good experience though. Here is the first dentist I've never had to. The place is very nice interior but not expensive (in fact, seems down right cheap given their specials they have all the time), and the quality of work is excellent. The bedside manner of both the techs and Dr. Patel and the receptionist Zandra is outstanding. Every time I go it is just a really enjoyable experience, which is a crazy thing to say about going to the Dentist. I have insurance by my friends who referred me said they didn't and they have some kind of special rate / in-house dental insurance program which made it same price as what I paid with good insurance. 50 stars. I refer people here all the time."
        },
        {
            "PersonID": "cQD_ta5NAaaVY0RyLp68eg",
            "PersonURLpart": "/user_details?userid=cQD_ta5NAaaVY0RyLp68eg",
            "PersonName": "Matthew W.",
            "ReviewDate": "2018-10-16",
            "Rating": 5,
            "ReviewText": " This interview is a bit late. I went to the Parmer location of enamel dentistry with a front tooth filling chipped off from eating an apple due to a previous bad job done by a different dentist I went to a while back that handled the chipped tooth incorrectly by using a filling of some sort on the tooth which was wrong to do due to pulp(nerve) being exposed. Enamel Dentistry immediately helped me out by sending me to have a root canal done at this location(enamel dentistry S Lamar)and it was absolutely painless and took less than 30 minutes. I had a crown put in at the other location (Enamel Dentistry Parmer Park) first a temporary and then a permanent a few weeks later and I have to say it was again absolutely painless and a  very good job Great work and very professional business. The staff and dentists are super friendly and helpful. 11/10 recommend this dentistry! Thank you so much for your teams service! Enamel Dentistry as a whole whichever location is excellent and a go to for emergencies or any other dental needs! Very impressed."
        },
        {
            "PersonID": "RLpICWQf3bMCNGlJVvKF_A",
            "PersonURLpart": "/user_details?userid=RLpICWQf3bMCNGlJVvKF_A",
            "PersonName": "P S.",
            "ReviewDate": "2018-03-16",
            "Rating": 5,
            "ReviewText": " Phenomenal.  In town for SXSW, had a loose crown, got an appointment, and was in and out of the office in less than 20 min.  Dr. C and uber friendly staff are fun to talk to, and oh my what a gorgeous office!  And wireless X-ray gun that looks like some space blaster???  #awesome"
        },
        {
            "PersonID": "nccMVm9BBoujqlPA2RbBsg",
            "PersonURLpart": "/user_details?userid=nccMVm9BBoujqlPA2RbBsg",
            "PersonName": "Tish I.",
            "ReviewDate": "2017-08-14",
            "Rating": 5,
            "ReviewText": " Really good experience with Dr. C and his staff!  I took my 15-year-old son for his annual cleaning and check up. They were very thorough. It's kind of a hip office, very Austin. The dental hygienist explained and educated my son on his hygiene habits - which are less than stellar. Dr. C spent time answering our questions and gave a very thorough examination with latest and greatest technology   My son was able to watch Netflix while in the chair. They were great about taking the anxiety out of dental visits. Overall great experience, I would highly recommend them"
        },
        {
            "PersonID": "E8TRqh-M9oIywBXVgVFENQ",
            "PersonURLpart": "/user_details?userid=E8TRqh-M9oIywBXVgVFENQ",
            "PersonName": "Shelby F.",
            "ReviewDate": "2018-07-14",
            "Rating": 5,
            "ReviewText": " I was with a group on a Bachelorette trip and I began to have the worth toothache ever.i couldn't think and tears were pouring from my face.I was embarrassed and in a large amount of pain and the staff was so patient and calming.the atmosphere was relaxing and cute! The dentist explained what was going on and made sure I understood as well.he went over the medications he was prescribing me as well.This office is great if you need a cleaning, or if you are in an emergency and need attention immediately !In the beginning of a visit the office has a menu to choose from for things to relax you such as towels, drinks, beer, wine, just to comfort the Patient.The sunglasses they let me keep is a great keepsake."
        },
        {
            "PersonID": "S6S2BfXy2Etur7OK_gp-Vg",
            "PersonURLpart": "/user_details?userid=S6S2BfXy2Etur7OK_gp-Vg",
            "PersonName": "Leighton C.",
            "ReviewDate": "2018-02-27",
            "Rating": 5,
            "ReviewText": " Dr. Patel is a rock star Dentist. I had a crown put in and unfortunately the crown came back with a not so perfect fit. Dr. Patel was a wizard with the fit and was very patient and even insistent that we make sure the crowns fit was perfect. I'm very satisfied with his work and will continue to visit them. Not to mention they are the only dentist I've been to that has Netflix set up at every station for you to watch on a nice big flat screen. They also have a free comfort menu that includes things like water, beer, wine, headphones, blanket, neck pillow, warm scented towel and a bunch of other stuff. It's an awesome practice!"
        },
        {
            "PersonID": "blYWJpOmScmksjj0WfrRtQ",
            "PersonURLpart": "/user_details?userid=blYWJpOmScmksjj0WfrRtQ",
            "PersonName": "Eric S.",
            "ReviewDate": "2016-07-01",
            "Rating": 5,
            "ReviewText": " Love this place... And I HATE going to the dentist This is the third dentist I have been to in Austin and I can say for certain that this is going to be my permanent dentist going forward.The guys are both super smart and make me feel at home... Plus what dentist office has a \"comfort menu\" with beer, wine, phone chargers, pillows, blankets.Amazing place. Will def be back... In 6 months exactly lol The comfort menu lol"
        },
        {
            "PersonID": "v25LzUXosyP-FLSBA1ZMCQ",
            "PersonURLpart": "/user_details?userid=v25LzUXosyP-FLSBA1ZMCQ",
            "PersonName": "Megan B.",
            "ReviewDate": "2018-01-15",
            "Rating": 5,
            "ReviewText": " Incredible staff and dentists with the latest technologies to make your procedures and cleanings quick and pain free. Their services are also surprisingly reasonably priced. I have recommended them to my boyfriend and coworkers!"
        },
        {
            "PersonID": "m6IxAcX0XEDEJRQJxXvmwA",
            "PersonURLpart": "/user_details?userid=m6IxAcX0XEDEJRQJxXvmwA",
            "PersonName": "Beau D.",
            "ReviewDate": "2017-04-17",
            "Rating": 5,
            "ReviewText": " Dr C and the staff were great today!I came in, as a new patient, and was greeted pleasantly, processed quickly, and was even given a fun menu of extras to choose from.I was taken back almost immediately after checking in by fun and cheerful staff.Dr C was in to see me super fast. He was swift and thorough. He showed me exactly what my problem was,  and we agreed on a treatment plan.The payment consult was handled chair- side, and payment was a breeze. The procedure was as pleasant as possible, and I was out much more quickly than expected.This place does cleanings and root canals in the same chair! I have zero negatives about my experience here... and I've been to plenty of dentists.Dr C, you've earned my  repeat business."
        },
        {
            "PersonID": "wihq7ZUzr06vO0yUEvV1Pg",
            "PersonURLpart": "/user_details?userid=wihq7ZUzr06vO0yUEvV1Pg",
            "PersonName": "Kristen Z.",
            "ReviewDate": "2018-12-04",
            "Rating": 5,
            "ReviewText": " I've been going to Enamel Dentistry for about two years, and I have nothing but great things to say about this practice. Dr. Chodavadia always seems to truly care about how you're doing and what you've been up to, and is just genuinely friendly and kind, as are the rest of the team. I had an appointment for a cleaning at 8AM this morning, and a meeting at 9AM. I let the team know and they got me in and out of the chair right on time.If you are one of those people who is afraid of going to the dentist, this is where you need to go! I personally do not have any dental/ortho phobias, but I'm pretty sure if everyone went here, no one would. Enamel dentistry provides a good experience and you'll always feel well taken care of when you leave. Business owner information Hardik C. Business Owner 12/5/2018 Thank you so much for you kind words Kristen! We love our patients and really try and create a great experience for them! I’m glad that what we’re doing is working!Have a happy holidays and I’ll chat with you next time!Dr. Chodavadia Read more"
        },
        {
            "PersonID": "vuz35yxqFFFimyR_0qDzKQ",
            "PersonURLpart": "/user_details?userid=vuz35yxqFFFimyR_0qDzKQ",
            "PersonName": "Jessica C.",
            "ReviewDate": "2018-01-29",
            "Rating": 5,
            "ReviewText": " Dr. C and his staff are amazing!! I normally dread going to the dentist but they made it such a great experience I will be happy going back for my regular cleanings. I honestly can't say enough good things about this dental office!!"
        },
        {
            "PersonID": "xiymgEQOmoZ_iKM3r1CNdA",
            "PersonURLpart": "/user_details?userid=xiymgEQOmoZ_iKM3r1CNdA",
            "PersonName": "Purvi P.",
            "ReviewDate": "2017-12-17",
            "Rating": 5,
            "ReviewText": " So grateful my husband is finally getting work done on he's teeth, all thanks to Dr Patel! We live in Dallas and come to Austin for he's dental needs because he feels comfortable with Dr Patel. He has lots of anxiety when it comes to getting work done on he's teeth but the moment we walk in everyone is so nice and comforting. My husband loves the headphones, and I enjoy the Netflix. They have tons of comforting items which makes the visits even better!!"
        },
        {
            "PersonID": "eJU1v4NQPXLye6yzkiQblQ",
            "PersonURLpart": "/user_details?userid=eJU1v4NQPXLye6yzkiQblQ",
            "PersonName": "Mallory B.",
            "ReviewDate": "2018-03-09",
            "Rating": 5,
            "ReviewText": " The best dentistry experience, which is something I never thought I'd say. Laid back, trendy environment but extremely clean and professional. Styled like the type of place you'd expect from Austin! I had Dr. C and (I believe it was) Monica, who were both so thorough, compassionate, and enthusiastic. They make you feel extremely comfortable here and capable of trusting them to not put you through a miserable teeth cleaning or pocket pick you afterwards. I've always dreaded the next dentist appointment, but I don't find that feeling necessary anymore."
        },
        {
            "PersonID": "gTYv8rmIyxXVL1KnNSogyA",
            "PersonURLpart": "/user_details?userid=gTYv8rmIyxXVL1KnNSogyA",
            "PersonName": "Robyn M.",
            "ReviewDate": "2017-08-17",
            "Rating": 5,
            "ReviewText": " I had my first appointment here this morning. Everyone seemed super friendly and seemed liked they enjoyed each other and working there. My hygenist was fantastic! Friendly, funny, and most importantly a pain free cleaning. I am actually looking forward to my next cleaning and I was going through life mostly thinking that phrase would only be uttered in that context of when pigs fly. So yay them! Plus, easy parking in South Lamar."
        },
        {
            "PersonID": "1FsM1-y_oay3srmPfbJdRQ",
            "PersonURLpart": "/user_details?userid=1FsM1-y_oay3srmPfbJdRQ",
            "PersonName": "Nalin V.",
            "ReviewDate": "2016-08-08",
            "Rating": 5,
            "ReviewText": " I heard about this new office through a friend and it did not disappoint. It's a brand new space with modern lighting and a great atmosphere. They had me fill out all of my paperwork online before walking through the door which meant I didn't have to wait for anything before getting started. These guys were so quick I didn't get to enjoy the excellent selection on their comfort menu (local beers/wine/pillow/blanket). But best of all their schedule caters to working professionals. I didn't have to take time off from work to get an appointment since they're actually open after 5pm.The service was great too. Dr. Patel did not just my fillings but also my cleaning (rather than an assistant/hygeinist). He taught me a new easier way to floss that's made the process so much easier for me. He also clearly walked me through all of his recommendations, but wasn't pushy like other offices I've visited before. On the whole they're really professional and friendly, and I'd happily recommend them to everyone. For once I actually look forward to coming back for my follow-up appointment later this year."
        },
        {
            "PersonID": "J01RR5Akh-KkNELgeAO5yw",
            "PersonURLpart": "/user_details?userid=J01RR5Akh-KkNELgeAO5yw",
            "PersonName": "Niña M.",
            "ReviewDate": "2017-03-29",
            "Rating": 5,
            "ReviewText": " Pros: Very pro active customer service/Friendly, well trained and educated staffs and dentists/Clean, new, cool and high tech equipped facility/Awesome customer follow up/Accessible location and plenty of parking spaces/Appropriate service fees/Thorough assessment of your over all teeth-gum health/No hidden fees or manipulation to do extra work. They advise. You decide. Cons: They don't have a Denver clinic where we are moving/I didn't get the warm lavender cloth after my appointments. hehehDetails below. Read on.  MAIN REASON. The main reason why I chose to go to Enamel Dentistry is, for obvious reason,  the ratings and the CONSISTENCY and COHESIVENESS of the reviews written about them. Sometimes you read the reviews on YELP and the reviews are all at odds and it does not make sense. The reviews about Enamel are just the same - they are awesome, provides good and quality service and they are the number 1 dental clinic in Austin. After reading thoroughly almost all the reviews, I decided to email them. I was busy with some paperwork then so I had to email. Nicole answered me right away and was very informative and clear with her reply. I signed up the \"new patient form\" from the website and it was all set.  The day after i signed the \"new patient form\", Nicole called me to say that there is something wrong with the insurance information I gave. She found a glitch with the info I gave and acted upon it. I have lived in 5 countries so I know customer service in different context. Nicole has raised the bar!Reception.  My husband and I arrived ten minutes before our appointment. Nicole greeted us with her beautiful morning smile, not a grumpy face that says you are an inconvenience. Nicole went through the paperwork, did confirmation re: our medical records and asked us if we need something to drink. They offer a menu for drinks and some comfy things like a pillow, warm lavender towel and all sort of complimentary stuffs.Clinic Tour. An equally nice and beautiful Brittney came to show us around the clinic. It was nice to see the whole facility. Having the tour made me not only see the actual room I was in for my teeth cleaning but to see all the other places. And boy, the whole place is squeaky clean. Literally, I can lay down in their WC's floor if I want to. No exaggeration.The teeth cleaning.I started with an x-ray using this really high tech machine. It was fast. Brittney did a good job. I went into this nice room - comfy chair, beautiful interior,great view of the street, really high tech medical machine/apparatus - and my teeth was checked one by one through a thorough x ray/3d imaging. Brittney and Dillon was a great tandem in making it possible to have an overview of the condition of my teeth and gums. They were very hospitable offering Netflix on the TV, something to drink and so gentle while they dig through every corner of my gums to get the x ray/3d.  Dillon was very good in explaining what he is about to do. Few minutes after, Dr.Patel came and explained what he has seen from the x ray/3d imaging. He was very eloquent in explaining the over all health of my teeth & gum. Since I have eaten a lot of chocolates sweet mangoes when I was a kid,  I have done 2 root canal and some other stuffs (poor me...hehehe), I was advised to do a \"deep cleaning\" instead of a normal cleaning. My husband was very satisfied with his normal teeth cleaning. He said that it was nicely done.I came back after few days to have my deep cleaning. True to its word - it was really a DEEP cleaning. Imagine body scrub, deep pore cleansing and  deep tissue muscle thai massage.You can equate those to Dr. Patel's teeth deep cleaning. Every teeth - its nook, curves, gum hold and all that - he did what he needed to do to clean it, polish it and make it in the best condition. Dr. Patel didnt rush it.  He was very intentional with every pull, scrub, and polishing he did. He was very kind in explaining in what he was about to do. He was always asking if I was feeling okey or I felt any pain. Excellence and Sincerity= middle names of Dr. Patel. :)While I had my deep teeth cleaning, I overheard Dr. Hardik, on the other room, many times asking his patient if she/he is okey. That's servanthood, people. Rare trait at this time. FOLLOW UP.They send several text reminders before my appointments. It is nice to be reminded.It has been a day since I had my deep teeth cleaning. Dr. Patel (the man himself, not some automated voice) called to check on  my condition - gum, teeth and all that. I missed the call but he left a VM.  I appreciate the follow up call they do for their patients who need an extra teeth attention. GIVEAWAY. They gave us two goody bags - toothbrush, toothpaste and floss. And the bag is cute. __Thank you Enamel crew for a wonderful service we have received from you. One of my highlights in living in Austin (less than a year). Sounds crazy but it is true! :"
        },
        {
            "PersonID": "G_BX4sE5HHGHSG2kLhjzbw",
            "PersonURLpart": "/user_details?userid=G_BX4sE5HHGHSG2kLhjzbw",
            "PersonName": "Santino G.",
            "ReviewDate": "2018-04-14",
            "Rating": 5,
            "ReviewText": " Every experience I have had at Enamel has been great. Dr. C and the friendly staff provide a welcoming, comfortable, and cool atmosphere for dental work, which is hard to say for most places. They have great service and nice paintings on the wall. No complaints at all - Thanks for always making me a happy customer! - Santino"
        },
        {
            "PersonID": "UvGrtngH9e8MFhaWznAXww",
            "PersonURLpart": "/user_details?userid=UvGrtngH9e8MFhaWznAXww",
            "PersonName": "Komal S.",
            "ReviewDate": "2017-04-12",
            "Rating": 5,
            "ReviewText": " These guys are the best! Amazing experience and great dentistry. Root canals are painless here! Place is new and modern, exactly what you want when searching for healthcare. Comfort menu puts this place over the top."
        },
        {
            "PersonID": "WjIOr86OW7ThodwTaYj0rQ",
            "PersonURLpart": "/user_details?userid=WjIOr86OW7ThodwTaYj0rQ",
            "PersonName": "Cole S.",
            "ReviewDate": "2017-04-03",
            "Rating": 5,
            "ReviewText": " I had my best experience I've ever had at a dentist here at Enamel. The whole office is modern and the staff is very friendly! My dentist was Patel and he was very conservative with his approach on what to do with my situation. 10/10 would recommend to other people to check this place out."
        },
        {
            "PersonID": "61di3U1QNPhdhZP9MOyG-w",
            "PersonURLpart": "/user_details?userid=61di3U1QNPhdhZP9MOyG-w",
            "PersonName": "Kimberly G.",
            "ReviewDate": "2017-01-20",
            "Rating": 5,
            "ReviewText": " Austinites! If you're looking for a new dentist, go see Dr. C + Dr. Patel at Enamel Dentistry. I'm spoiled, and I've always been able to go to my mom's office because she's a dental assistant. So, this was my first experience seeing a dentist that my mom didn't work alongside, and it was fantastic! They have a great team and offer comfort items like beer, wine, pillows, phone chargers, TV's, etc. It was easy to make an appointment and Dr. C and Dylan were very knowledgeable and made me feel really comfortable during my cleaning.Highlights:-Clean, modern office (with some awesome art on the walls)-Paperless check-in (you can fill out all the forms online before your appointment)-Thorough exam and cleaning-Friendly, welcoming staff from start to finish-TVs and big windows (windows are if you're seated in the front operatories) Great experience! :)"
        },
        {
            "PersonID": "91HVQL0AEbfKP6-Bje5iCw",
            "PersonURLpart": "/user_details?userid=91HVQL0AEbfKP6-Bje5iCw",
            "PersonName": "Salman R.",
            "ReviewDate": "2019-12-16",
            "Rating": 3,
            "ReviewText": " UDATE 2:: The Doctor and Enamel Dentistry was kind enough to take care of this billing issue and have refunded the amount. I appreciate them keeping to their word and hope that you do not have a bad experience if you decide to visit them. I know, for sure, you won't have an issue with anybody who works there because they are very nice and as I have experienced, correct any mistakes that may have happened. UPDATE:: not even 10 mins after writing this review, the dentist I had the bad experience with called me and apologized. He then provided a way to help resolve the billing issue. I definitely appreciate this gesture and hope that this attention to detail showcases that their practice has been improving. The rating is going up now to reflect their willingness to improve and for their gesture to resolve the billing issues. **Original**The dentist I saw at Enamel Dentistry was constantly making mistakes. I had to come back multiple times in order to get my cap installed correctly...and he still didn't do it right. They try to make it seem like they are professional but only appear to focus on buying new dentist tools they never know how to use. After hesitating when he realized he made another mistake and there was a gap between the teeth(the floss should have stuck better between the teeth when pulling it out as he mentioned), he let me go. There was still a gap and he let me go even though this caused additional issues since the cap was set incorrectly. Instead of going back and have them work on my teeth more, I simply stopped going and requested that they stop reaching out. Now, about two years later I am getting a bill for services that were way below any standard I have experienced. When I attempted to pay this bill, their new online payment system does not give you any indication you have successfully paid. Yet another tool they have invested in that is more show than substance. I would recommend anybody else other than this team. Stay away."
        },
        {
            "PersonID": "9Z6WPnALolbwMYYMgJ3LOw",
            "PersonURLpart": "/user_details?userid=9Z6WPnALolbwMYYMgJ3LOw",
            "PersonName": "David K.",
            "ReviewDate": "2017-12-21",
            "Rating": 5,
            "ReviewText": " 5 star experience.  Clean facility,  state of the art equipment, and exceptional Doctors and staff.  I am glad I decided to come here as I have an ingrained fear of the Dentist that I just can't shake, but this place is my new home office.  Thanks again."
        },
        {
            "PersonID": "pNCpTdA2guNe9vZHbHojSA",
            "PersonURLpart": "/user_details?userid=pNCpTdA2guNe9vZHbHojSA",
            "PersonName": "Krystle H.",
            "ReviewDate": "2018-02-20",
            "Rating": 5,
            "ReviewText": " I loved everything about this office. I can honestly say I look foward to my follow-up and next dental visit. Dr. Patel is so awesome. He and his staff made me feel comfortable with no judgements. I really appreciated the office flow. I will say, make sure to look over their comfort menu... the headphones may come in use, but even so I loved everything about my first visit. Talk about the best customer service I've experienced in awhile."
        },
        {
            "PersonID": "CMnUJXYiFy9p4-bISlanVg",
            "PersonURLpart": "/user_details?userid=CMnUJXYiFy9p4-bISlanVg",
            "PersonName": "Laura S.",
            "ReviewDate": "2017-11-27",
            "Rating": 5,
            "ReviewText": " I just recently switched dentists after a negative experience with my previous one. I couldn't be happier with my decision to switch to Enamel. I have seen Dr. C for a cleaning and fillings and both were as positive as a trip to the dentist can be."
        },
        {
            "PersonID": "ai1XE5FFjmwm680yicVleQ",
            "PersonURLpart": "/user_details?userid=ai1XE5FFjmwm680yicVleQ",
            "PersonName": "Lauren B.",
            "ReviewDate": "2017-03-21",
            "Rating": 5,
            "ReviewText": " I've always hated the dentist, but this place is awesome! First off, the staff is so great and welcoming. They made me feel 100% comfortable even though I was in a lot of pain and was honestly really nervous since it's been a while that I've seen the dentist. The best thing? They serve wine and beer, that makes a 5 star in itself! Dr. Patel is by far the most personable and non judgemental dentist I've ever seen. He kept me informed the entire time during the visit and kept me calm. Love this place, maybe going to the dentist from now on won't be so stressful after all."
        },
        {
            "PersonID": "B0ThBTSzCBLDaUImtWDalg",
            "PersonURLpart": "/user_details?userid=B0ThBTSzCBLDaUImtWDalg",
            "PersonName": "Jennifer B.",
            "ReviewDate": "2017-11-09",
            "Rating": 5,
            "ReviewText": " It's always hard finding a dentist or doctor in a new city. Every other dental office had so so reviews or bad hours. Once I made my appointment and worked with Dr. Patel I knew this was the place for me. He explained the best route to take for my oral health and they even came up with a game plan showing me the steps and pricing (which is great on a budget, they offer payment options too!). I was slightly skeptical of the 5 stars but they truly deserve it at Enamel."
        },
        {
            "PersonID": "wQuwVtxy28-26PsSk-mAOQ",
            "PersonURLpart": "/user_details?userid=wQuwVtxy28-26PsSk-mAOQ",
            "PersonName": "Jody J.",
            "ReviewDate": "2017-02-17",
            "Rating": 5,
            "ReviewText": " Highly recommend. Office and staff are awesome. Dr. Patel is by far the best dentist I have ever been to. Very thorough and takes time to explain everything. Makes going to the dentist a pleasant experience!"
        },
        {
            "PersonID": "2twdYcicnCkp8aEbiG6QeQ",
            "PersonURLpart": "/user_details?userid=2twdYcicnCkp8aEbiG6QeQ",
            "PersonName": "Tamina Z.",
            "ReviewDate": "2017-08-01",
            "Rating": 5,
            "ReviewText": " I just left and honestly love this place so much. I booked 2 hours of time-off to get a cavity filled, but it only took 30 minutes. No joke, in and out the door in less than 30 minutes. I hate going to the dentist, but they make the experience 10000x better."
        },
        {
            "PersonID": "OAfGP7-VJfsLDV4GQcxepw",
            "PersonURLpart": "/user_details?userid=OAfGP7-VJfsLDV4GQcxepw",
            "PersonName": "Neil P.",
            "ReviewDate": "2018-09-10",
            "Rating": 5,
            "ReviewText": " From the open and welcoming atmosphere of the office to the outstanding care and service of the doctors and staff, this was the best dentist I have ever been to. Dr. Patel was very informative about the procedure he was doing to my teeth, and answered all my questions and concerns I had. Overall I am very satisfied with the service that was provided, and I think I just found my new primary dentist. Thank you Dr. Patel and everyone at Enamel Dentistry.!"
        },
        {
            "PersonID": "yKiFIXAJpEjT70aKKLsJHQ",
            "PersonURLpart": "/user_details?userid=yKiFIXAJpEjT70aKKLsJHQ",
            "PersonName": "Mrs V.",
            "ReviewDate": "2017-05-01",
            "Rating": 5,
            "ReviewText": " Thorough, kind, educated and I was in and out in under 20 minutes for an exam for a toothache. Referred me to endodontist. Plus, theres netflix. Ill be back!"
        },
        {
            "PersonID": "tzy_AUQ7MINSvjRANRpLwQ",
            "PersonURLpart": "/user_details?userid=tzy_AUQ7MINSvjRANRpLwQ",
            "PersonName": "John H.",
            "ReviewDate": "2017-10-09",
            "Rating": 5,
            "ReviewText": " Best dentist I've been too. I'm new in Austin and had a great experience. Friendly professional staff and a nice clean open concept office. I would recommend to anyone on the area."
        },
        {
            "PersonID": "Urj2FPpLn35YXes52cPHHw",
            "PersonURLpart": "/user_details?userid=Urj2FPpLn35YXes52cPHHw",
            "PersonName": "Caroline B.",
            "ReviewDate": "2017-04-08",
            "Rating": 5,
            "ReviewText": " I just moved to Austin and needed to find a new dentist quickly. I drive past Enamel everyday on my way to work so I looked up the reviews and decided to give it try. This office/team is awesome! Everyone was so friendly (and they have Saturday hours once a month which is sooo convenient)! They give new patients a tour of the office and you can tell they take extra care to be sure you are comfortable. Their comfort menu is adorable and they have beer/wine if you want it and Netflix in each room! As far as the actual dentistry part... Dr. Patel was so friendly and professional at the same time. He explained everything he was doing/thinking very clearly to me. I'm very glad to have found my new dentist!!"
        },
        {
            "PersonID": "TBfO0Mblzf15KG72ZmtaRw",
            "PersonURLpart": "/user_details?userid=TBfO0Mblzf15KG72ZmtaRw",
            "PersonName": "Anthony L.",
            "ReviewDate": "2018-04-13",
            "Rating": 5,
            "ReviewText": " If you're like me, everything about going to the dentist sounds horrible including the dentist. But these folks are a super friendly team. I just watched Netflix most of the time and felt really relaxed rather than being all stressed out. They have nice options for dental plans and payment options, since I don't have insurance, that was pretty sweet."
        },
        {
            "PersonID": "Nf5SbCCd3QLpt6rpj8gFEA",
            "PersonURLpart": "/user_details?userid=Nf5SbCCd3QLpt6rpj8gFEA",
            "PersonName": "Rob D.",
            "ReviewDate": "2017-07-06",
            "Rating": 5,
            "ReviewText": " Great experience. Very courteous team, hygienist was sweet and gentle. Dentist educated me on dental health. Facilities were very modern and clean. I did notice one dust bunny in the corner. Other than that, a pleasant experience. I'll be going back for some fillings. Wish me luck!!"
        },
        {
            "PersonID": "3Byf1LBo8fNwbxR812V51w",
            "PersonURLpart": "/user_details?userid=3Byf1LBo8fNwbxR812V51w",
            "PersonName": "Lasha K.",
            "ReviewDate": "2017-10-30",
            "Rating": 3,
            "ReviewText": " I'll start by saying the 3 stars has more to do with me and not Enamel Dentistry. By way of background, I am 40, had been seeing my same dentist for about 10 years, when she had to unexpectedly close her practice. Thus, I sought out a new tooth fairy. I chose Enamel based in part on the high reviews and its location because it is close to my work and my home. I gave it 3 stars because I found the office kind of stressful. Being located at Lamar and Manchaca, you can hear and see the roar of cars as they speed by. Music is on (great playlists) but so is the TV. These comforts should put you at ease, but I didn't know where to look or what to listen to..The colors are purple and green - bright and lively and cool. But, not terribly calming to me.The office offers a comfort menu - consisting of wine, beer, and scented towels. However, they were never offered, and I didn't ask if they were really available. The hygienist was young and was courteous. However, her courtesy slipped into the unsure for me \"are you asking me if you should measure my root pockets\" or \"are you telling me you are going to measure my root pockets\" Either way, I want the professional to take the lead and then be open to questions if I have them.I took lots of x-rays. I never saw them. And, I'm unsure if my dentist did either. In the end, this place is solid. I'm sure they are using all of the latest technology. No part of my treatment hurt. My teeth felt clean. I just think I am too old for this place. I' m going back to the basics: see Barton Springs Dental Group."
        },
        {
            "PersonID": "g7_d7Uohnww30n4o2nio2w",
            "PersonURLpart": "/user_details?userid=g7_d7Uohnww30n4o2nio2w",
            "PersonName": "Ryan G.",
            "ReviewDate": "2017-02-15",
            "Rating": 5,
            "ReviewText": " Enamel Dentistry is great! My first visit was pleasant (and I had work on 3 teeth!). They have a more 'modern' take on the dentists office: you can get everything from coffee to beer to a hot towel while you wait (and my wait was not long), and they have TVs with Roku hooked up in every office so that patients can put something on to be distracted by during their appointment. Pretty cool."
        },
        {
            "PersonID": "QnESuYC5MTvlOi1w3c3T6w",
            "PersonURLpart": "/user_details?userid=QnESuYC5MTvlOi1w3c3T6w",
            "PersonName": "Kevin N.",
            "ReviewDate": "2017-10-06",
            "Rating": 5,
            "ReviewText": " Everyone was very helpful. Dr. Patel went to great lengths to ensure that I was well informed in order to make decisions. The office has a very hip vibe and goes above and beyond what the typical office would provide to each customer. I would recommend they put a sign on the staff entrance though as it is not clear where that door leads."
        },
        {
            "PersonID": "hL5y2VlKgnzisfWY6BD12Q",
            "PersonURLpart": "/user_details?userid=hL5y2VlKgnzisfWY6BD12Q",
            "PersonName": "W S.",
            "ReviewDate": "2016-10-27",
            "Rating": 5,
            "ReviewText": " Dr. C and the Enamel Dentristry staff is awesome. The office is actually pretty cool looking and there's even a Roku in the rooms so you can watch or listen while you get your dental work done. I'm really glad I chose this place and couldn't be happier with the level of service here. Keep up the great work!"
        },
        {
            "PersonID": "cxIZ9-kWwSz_yK-tBxLetw",
            "PersonURLpart": "/user_details?userid=cxIZ9-kWwSz_yK-tBxLetw",
            "PersonName": "Jon K.",
            "ReviewDate": "2019-01-08",
            "Rating": 5,
            "ReviewText": " Very Professional and friendly staff, could not have asked for more knowledgable and kind individuals to take care of my teeth.  I had two fillings done there and a mouthguard made, all three visits were completely painless!!  Having been to quite a few dentists in the past i can say that Enamel Dentistry has been my favorite by far!"
        },
        {
            "PersonID": "yKtu5crwbtMCRDRLDl6flQ",
            "PersonURLpart": "/user_details?userid=yKtu5crwbtMCRDRLDl6flQ",
            "PersonName": "Kate G.",
            "ReviewDate": "2017-03-31",
            "Rating": 5,
            "ReviewText": " Awesome first experience with Enamel Dentistry! The doctor greeted me right when I walked in the door (and actually checked me in which was cool). There was absolutely no wait. I was taken straight in and give a great little tour of the office. All the doctors and nurses are really young and friendly and really make you feel at home. They even let me watch the Dave Chappell Netflix special while I was in the chair :) Overall the parking was super easy (which is clutch), the people were so kind and the entirely process was a breeze. Two thumbs up from me on this place!"
        },
        {
            "PersonID": "PtEQ6LrPT4qO5L7sno95Hw",
            "PersonURLpart": "/user_details?userid=PtEQ6LrPT4qO5L7sno95Hw",
            "PersonName": "Annie P.",
            "ReviewDate": "2017-01-23",
            "Rating": 5,
            "ReviewText": " Yup. Still my favorite people. Went back to replace a broken crown that looks flawless. Forgot to mention perks: Netflix to watch while you're in the chair, free beverages while you wait. Nicole knows her stuff and she's on it! It feels good to be greeted by that kind of confidence at the dentist office! Dr.C and Dr.P run a great practice. Psst! Dr.C has the low down on the best pizza places in town. Fast, Efficient, Professional and Great Bedside Manner. They cover most PPO plans. I have an HMO so I paid out of pocket but gladly. Prices are reasonable and they were able to squeeze me in same day for a broken crown. Dr.Patel was upfront and gave an honest assessment. He devised a game plan to get the tooth fixed and was sensitive to my budget. Office staff is wonderful and I've got nothing but great vibes coming from there. Read more"
        },
        {
            "PersonID": "ln6FAmP61Bnu37_HpFyYSQ",
            "PersonURLpart": "/user_details?userid=ln6FAmP61Bnu37_HpFyYSQ",
            "PersonName": "Ann R.",
            "ReviewDate": "2017-04-21",
            "Rating": 5,
            "ReviewText": " I moved downtown 4 years ago. Ive slowly been changing over local doctors from my suburbia doctors.  My girlfriend recommended enamel.  I am so pleased. Great staff.  Great doctors.  State of the art gear and you even get to watch Netflix during your work!  Btw the dentist himself did my cleaning. That's a first!  Totally recommend"
        },
        {
            "PersonID": "EbtuwtnAbUvpR6f_IJ-25g",
            "PersonURLpart": "/user_details?userid=EbtuwtnAbUvpR6f_IJ-25g",
            "PersonName": "Jenn Z.",
            "ReviewDate": "2019-07-29",
            "Rating": 5,
            "ReviewText": " Amazing care and friendly service. Fixed my front teeth quickly and made the entire process so easy. Clinic is immaculate, tech friendly and always on time."
        },
        {
            "PersonID": "r8a0AWrXTIM9K-_NAriRAA",
            "PersonURLpart": "/user_details?userid=r8a0AWrXTIM9K-_NAriRAA",
            "PersonName": "Sherif I.",
            "ReviewDate": "2017-06-02",
            "Rating": 5,
            "ReviewText": " Great and honest dentist, very pleasant customer service. Filled a cavity that my other dentist said he can't fill. Awesome experience."
        },
        {
            "PersonID": "tOz658goXGNKEYh5VOMqww",
            "PersonURLpart": "/user_details?userid=tOz658goXGNKEYh5VOMqww",
            "PersonName": "Boseph C.",
            "ReviewDate": "2018-03-16",
            "Rating": 5,
            "ReviewText": " The staff did a really good job cleaning my teeth, and were even joking around with me a lot during the whole process.  I felt right at home!  Check these people out if you're looking for a new dentist."
        },
        {
            "PersonID": "TqyNSOtegQvbKLvJ4WRXsw",
            "PersonURLpart": "/user_details?userid=TqyNSOtegQvbKLvJ4WRXsw",
            "PersonName": "P P.",
            "ReviewDate": "2019-02-06",
            "Rating": 5,
            "ReviewText": " Great place to go for your dental care! I was referred to Enamel by a friend and was very pleased after my visit. Dr. Devish did a great job of decreasing my anxiety by educating me about my treatment so I knew what to expect. I definitely will recommend Enamel to all my friends!"
        },
        {
            "PersonID": "KONPVM6s5nMb5cBCWbHGvQ",
            "PersonURLpart": "/user_details?userid=KONPVM6s5nMb5cBCWbHGvQ",
            "PersonName": "Annie Y.",
            "ReviewDate": "2016-07-05",
            "Rating": 5,
            "ReviewText": " I have never wanted to write a review for a dental office before... Doesn't that say enough? They make you actually want to go to the dentist. Complimentary wine/beer etc. Netflix, and happy people. My first time visit was very easy with their new patient forms on their ipad, and they also got me an appointment on the same day. They treat you like a fellow human and that's really all that matters. I applaud them for changing the patient experience for the better!"
        },
        {
            "PersonID": "te5w4s8YZMRQ9GUBqkA--g",
            "PersonURLpart": "/user_details?userid=te5w4s8YZMRQ9GUBqkA--g",
            "PersonName": "Kris V.",
            "ReviewDate": "2017-03-30",
            "Rating": 5,
            "ReviewText": " I just had my teeth cleaned and it was a wonderful experience! From the moment I walked in I felt catered to and cared for. Everyone was attentive to my dental concerns and Dr. Patel thoroughly explained everything to me. I immediately recommended that my boyfriend try going there as well because I truly enjoyed the visit (and this is coming from someone who has generally had bad experiences with dentists)."
        },
        {
            "PersonID": "4hnX057Nw0j2ECFo7z_dcw",
            "PersonURLpart": "/user_details?userid=4hnX057Nw0j2ECFo7z_dcw",
            "PersonName": "Landon C.",
            "ReviewDate": "2017-10-19",
            "Rating": 5,
            "ReviewText": " I am always worried about dentists doing unnecessary procedures to squeeze an extra buck out of me. The people at Enamel have been nothing but fair and helpful. They have gone out of their way and probably cost themselves some money to make sure that I was taken care of. Thumbs up for great and honest service."
        },
        {
            "PersonID": "YCnwCqQXqTWB_hela1pDOA",
            "PersonURLpart": "/user_details?userid=YCnwCqQXqTWB_hela1pDOA",
            "PersonName": "Martin G.",
            "ReviewDate": "2017-06-06",
            "Rating": 5,
            "ReviewText": " New patient at Enamel. First impression is usually true in all instances for me, so the staff definitely made a positive impression on me just by the way they initially handled my first phone calls to set up my appointment. They were able to accommodate seeing me sooner on my first appointment. The staff in person are very friendly and do make every attempt to make sure that you are comfortable. The small things sometimes matter the most and this shows here. The dentists are very friendly and make sure they answer every question you may have. Would definitely recommend them for your next appointment."
        },
        {
            "PersonID": "9OK6xpQfyNZKNhxT4PhHcQ",
            "PersonURLpart": "/user_details?userid=9OK6xpQfyNZKNhxT4PhHcQ",
            "PersonName": "Al K.",
            "ReviewDate": "2018-11-06",
            "Rating": 5,
            "ReviewText": " I had a severe pain in one tooth.  Dr. Hardik Chodavadia took a personalized care of me. Thank you for the  VIP treatment. My tooth feels great after the root canal and a crown. Staff is also very courteous and helpful. I will recommend them to anyone who needs dental work."
        },
        {
            "PersonID": "x6Tb05qkFY-0nRshwMkv_w",
            "PersonURLpart": "/user_details?userid=x6Tb05qkFY-0nRshwMkv_w",
            "PersonName": "Emily R.",
            "ReviewDate": "2016-11-18",
            "Rating": 5,
            "ReviewText": " Best dentist experience ever! I was nervous about finding a new dental practice since I moved to cities. But seeing Dr. C put all my anxieties aside. The practice is well equipped with the latest technology and items designed for comfort, including heated neck warmers, a big screen TV with Netflix- and- though I did not partake- beer or wine! Dr C filled 2 cavities and I didn't feel a thing. Highly recommended!"
        },
        {
            "PersonID": "hHwk6am-wP0WHdet-DPEbA",
            "PersonURLpart": "/user_details?userid=hHwk6am-wP0WHdet-DPEbA",
            "PersonName": "Lisa H.",
            "ReviewDate": "2017-03-04",
            "Rating": 5,
            "ReviewText": " After not going to the dentist for years, I finally had to find a dentist in Austin. I really enjoyed the the paperless check in and it's so nice that they offer beer/wine. Everyone is very friendly! I truly appreciate the thoroughness and transparency of Dr. Patel. Looking forward to having healthier teeth!"
        },
        {
            "PersonID": "D4i18kDgkaNmFqTMOv81jg",
            "PersonURLpart": "/user_details?userid=D4i18kDgkaNmFqTMOv81jg",
            "PersonName": "Addy Q.",
            "ReviewDate": "2017-04-27",
            "Rating": 5,
            "ReviewText": " The most painless cavity treatment I've ever had. Seriously I felt 0 pain and I am incredibly terrified of drills. This team is pro and they use the good stuff. Something else I appreciate and have noticed the last couple times I have been there is that Dr. C is a great teacher to his assistants. He has a great natural ability to help people and that's cool! The whole office is very high-tech but also laid back, very clean and dedicated to making you feel extremely chill. Before I got my fillings done I was offered a glass of Pinot Gris."
        },
        {
            "PersonID": "10BpvgRGDtDsuL0jqdoXCg",
            "PersonURLpart": "/user_details?userid=10BpvgRGDtDsuL0jqdoXCg",
            "PersonName": "Brian T.",
            "ReviewDate": "2016-06-27",
            "Rating": 5,
            "ReviewText": " One of my friends recommended me this place. Coming here was one of the best decisions I've made in my life. I loved the atmosphere. The staff is extremely friendly and personable. I enjoyed getting a tour of the facility. I liked how there was Netflix access. Much better than normal daytime television you see at other offices. The whole experience was just very personal in a good way. Dr. Chodavadia has excellent bedside manner and a great conversationalist. He makes you feel extremely comfortable and provides a lot of great information about your teeth and dental concerns. I felt like I was talking to an honest professional who genuinely cared about me, as opposed to just being rushed in and out like at other offices. I can't imagine going to a different dentist office after my experience here. Highly highly recommend."
        },
        {
            "PersonID": "-CeVC2R6ziPorR10mDK1mQ",
            "PersonURLpart": "/user_details?userid=-CeVC2R6ziPorR10mDK1mQ",
            "PersonName": "Nicole E.",
            "ReviewDate": "2017-03-31",
            "Rating": 5,
            "ReviewText": " My experience here was incredible. I came in with horrible pain from a long standing broken tooth. They fit me in immediately. The whole staff was friendly and very helpful in the way of finances. I've never had a dentist visit that was so painless and fast."
        },
        {
            "PersonID": "etUM13KqaPHGPZKZnKK9QQ",
            "PersonURLpart": "/user_details?userid=etUM13KqaPHGPZKZnKK9QQ",
            "PersonName": "Rene A.",
            "ReviewDate": "2016-08-02",
            "Rating": 5,
            "ReviewText": " Had a mild discomfort on a tooth that was crowned and saw Dr Hardik or Dr. C is how he put it! Went in expecting the worse but after the exams and friendly professional service by the Dr and his staff was told that a cleaning and a simple night guard will remedy it and it did! I have no discomfort and my visit was awesome! Hasn't been 12 hrs. I Felt taken care of and was even offered a nice cool one! Watched Netflix during my exam and the cleaning procedure was flawless! I recommend Dr. C highly and I definitely found my new dentist! Look forward to my next visit! Nice job guys! Don't forget to notice the art! One of a kind! Ha!"
        },
        {
            "PersonID": "YZZRNqtZemBrOR_arYww1g",
            "PersonURLpart": "/user_details?userid=YZZRNqtZemBrOR_arYww1g",
            "PersonName": "Katie C.",
            "ReviewDate": "2017-03-19",
            "Rating": 5,
            "ReviewText": " Dr. C and his team were informative, friendly, and professional throughout my appointment. They made everything very easy for me, including the new patient paperwork and billing process. The technology was explained to me, and all my questions were answered transparently.Everyone in the office was laid back and wanted to ensure I was as comfortable as possible. I got to watch a Netflix show and was even given a blanket. The cleaning was super fast, and I barely had any waiting time throughout the entire process. Definitely recommend Dr. C to anyone looking for a new or better dentist! Very modern and friendly office."
        },
        {
            "PersonID": "hoWDZlhU5XMg22aFoFBZ5A",
            "PersonURLpart": "/user_details?userid=hoWDZlhU5XMg22aFoFBZ5A",
            "PersonName": "Nadia S.",
            "ReviewDate": "2019-01-30",
            "Rating": 5,
            "ReviewText": " This visit has been by far #1, my favorite and at the top of my list for general dentistry. Starting with an Amazing, very courteous staff to meeting a very much appreciated Dentist that didn't mind spending a extra few minutes, thoroughly educating his patient, to leaving with a handful of goodies and a very satisfied new patient. I highly recommend you stop by and visit yourself.. I dare you! Dr. Patel you have earned my 5 's. Thank you."
        },
        {
            "PersonID": "q6wmgT7o6KledaCQMjfxAg",
            "PersonURLpart": "/user_details?userid=q6wmgT7o6KledaCQMjfxAg",
            "PersonName": "Nirav P.",
            "ReviewDate": "2016-11-18",
            "Rating": 5,
            "ReviewText": " I went in for a check up after my root canal teeth was giving me a problem. The appointment process was easy and reminder was very helpful. On arrival the staff was very helpful and the comfort menu was awesome. Dr Patel was my dentist and was very thorough in explaining all the problem. Luckily I didn't have root canal problem but just needed a cleaning a multiple cavity filling. He was very informative on the cause and did not try to oversell any procedure. I highly recommend them. Thanks you Dr Patel and team for fixing me up."
        },
        {
            "PersonID": "JJSuPmFpWgw83HugPbm2vg",
            "PersonURLpart": "/user_details?userid=JJSuPmFpWgw83HugPbm2vg",
            "PersonName": "K.C. C.",
            "ReviewDate": "2017-04-06",
            "Rating": 5,
            "ReviewText": " I am so impressed with Enamel Dentistry. Dr. Patel is extremely thorough, hands-on and kind. He and his staff didn't rush me like former dentists and hygienists did. Dr. Patel identified two nagging problems immediately and worked at the speed of light to problem solve for them. I feel better already! Also, Nicole at the front desk is the best!A++!"
        },
        {
            "PersonID": "Zh3WtQbe7M_Ae5eke7F_AQ",
            "PersonURLpart": "/user_details?userid=Zh3WtQbe7M_Ae5eke7F_AQ",
            "PersonName": "Olivia H.",
            "ReviewDate": "2018-01-09",
            "Rating": 2,
            "ReviewText": " This was my first time at Enamel. I came for a cleaning and check up. This was the fastest cleaning I've ever had in my life, and I don't mean that in a good way. Not sure how I was able to have a full set of x-rays, a chat with the dentist about my teeth, and a cleaning in such a short amount of time. When he was flossing my teeth I noticed he would miss at least the last tooth, sometimes the last two. And when he was do the left so much debris still in my mouth. I ended up having to use the floss kit that every dentist gives you to take home, in this Dentist's bathroom to floss and rinse my own teeth. I was in there an additional 5 minutes cleaning my own teeth post cleaning with the dentist. I usually leave a dentist feeling super clean and satisfied. I left this one feeling gross and disgruntled. Luckily everything was covered by insurance so I didn't have to pay anything. Had I had to pay out of pocket for an experience like that, I would be beyond annoyed."
        },
        {
            "PersonID": "YB0ZDdR3msAWsbxRRCxOhg",
            "PersonURLpart": "/user_details?userid=YB0ZDdR3msAWsbxRRCxOhg",
            "PersonName": "Rishi G.",
            "ReviewDate": "2016-09-20",
            "Rating": 5,
            "ReviewText": " My experience was excellent - the staff was friendly, the space is like a spa, the doctors (Devish and Hardik) are extremely knowledgeable and laid back and the equipment is state of the art. Just what I was looking for!"
        },
        {
            "PersonID": "H8OusG1d8nFljH1nhwhJIQ",
            "PersonURLpart": "/user_details?userid=H8OusG1d8nFljH1nhwhJIQ",
            "PersonName": "Michael F.",
            "ReviewDate": "2016-06-03",
            "Rating": 5,
            "ReviewText": " First and foremost, this place will knock your socks off. All the latest, greatest technology and Netflix in the palm of your hand. When you walk in, Stephanie will offer you the 'Comfort Menu'. Should have taken a pic to post but, WOW! Impressive! The staff goes above and beyond to welcome you and make sure you are comfortable. No more filling out tons of forms on paper. It's all set up on an iPad and is very easy to follow. When entering the back, Dillion will take you on a quick tour of the facility, which I appreciated and was treated like a guest, not a patient. Dr. Chodavadia is very professional and extremely thorough. He made sure that I knew exactly what I was dealing with and although some of the work that I needed could be done there, he referred me to a Specialist that he knew could take care of my immediate issue. I will definitely go back for the work he can do once my issue is resolved. Dr. Patel, whom I only met, was extremely professional, pleasant and welcoming as well. A very warm atmosphere that helps create a gentle feeling that they are there to take care of you. I never once felt like I was getting service done on a vehicle (lol), (telling me something that I needed but did not). No issues with my insurance either. I highly recommend this dentistry for numerous reasons. Both Dr's. Chodavadia and Patel go out of their way, as does the entire staff, to make you feel like you're their only patient and they sincerely care about your dental wants and needs. From cleanings to dental cosmetology, this is the place to go! You'll definitely notice that you are treated differently. Not like a $ sign. If you're looking for a new dentist or are new in town, go to Enamel. You can thank me later!"
        },
        {
            "PersonID": "tB7ZEaAHtmbO1WO0PbabVg",
            "PersonURLpart": "/user_details?userid=tB7ZEaAHtmbO1WO0PbabVg",
            "PersonName": "Erin B.",
            "ReviewDate": "2017-12-12",
            "Rating": 2,
            "ReviewText": " So, everyone at Enamel was very nice and cheerful, can't deny that! And i originally went here because of the high Yelp reviews. However, upon going in I was immediately told about their contest where you are entered for a flat screen TV for leaving a 5 star yelp review :| Honestly the environment isn't the most professional. Everyone there is so young and they almost try to appear too 'cool'. I've had the dentist explaining how to do things and what things mean to the nurses/hygienists many times and they always seem to be questioning themselves, it isn't very assuring. I also have never had a cavity in my life but when I came in I was told I had 12???? I still agreed to get them filled but in hind sight I definitely would have gotten a second opinion. When the fillings were done my jaw was so hurt by the injections that I literally couldn't open it fully for weeks. I also had to go back in later because it was still hurting so badly and there was just an open area that didn't get filled! My final straw was when I agreed to be fitted for a night guard. They completely messed up my imprint during the fitting. When I came back it wasn't even close to the shape of my mouth. I should have gone somewhere else well before this, I just think people should know what they are in for. Great experience, really nice facilities and the dentist explained everything to me in a very personable and friendly way. Even gave you the Netflix remote while you were sitting in the chair! Read more"
        },
        {
            "PersonID": "JX-L0-00Axw6gwxu8PKXXQ",
            "PersonURLpart": "/user_details?userid=JX-L0-00Axw6gwxu8PKXXQ",
            "PersonName": "Regina S.",
            "ReviewDate": "2017-07-05",
            "Rating": 5,
            "ReviewText": " Incredible service! Felt very comfortable and confident! Everyone who works here is the nicest!"
        },
        {
            "PersonID": "8vApTWzZH1AASR6-x1ODHA",
            "PersonURLpart": "/user_details?userid=8vApTWzZH1AASR6-x1ODHA",
            "PersonName": "Alex B.",
            "ReviewDate": "2017-05-23",
            "Rating": 5,
            "ReviewText": " I had such a great experience at Enamel Dentistry! The staff was super friendly and professional. I have definitely found a new dentist in town."
        },
        {
            "PersonID": "mH7CkeWi6S90LVEtYa-uww",
            "PersonURLpart": "/user_details?userid=mH7CkeWi6S90LVEtYa-uww",
            "PersonName": "Janie T.",
            "ReviewDate": "2018-09-05",
            "Rating": 4,
            "ReviewText": " Not crazy about the music choice, but everything else was great. Everyone was very personable. Cost and procedures were explained in detail. Would recommend Dr C and crew to anyone."
        },
        {
            "PersonID": "XkeDqXjwjnlUbtyQ8mkdYQ",
            "PersonURLpart": "/user_details?userid=XkeDqXjwjnlUbtyQ8mkdYQ",
            "PersonName": "CBella Q.",
            "ReviewDate": "2019-12-08",
            "Rating": 5,
            "ReviewText": " We have been visiting Doctor Patel and Doctor C for over three years and every visit has been truly exceptional. From the moment you walk into their office, it's obvious that they put a great deal of thought into every single detail. Their customer service is definitely noteworthy, and their state of the art equipment makes us look forward to every visit. For my son and daughter, one of the best parts is being able to watch a movie while they are working on their teeth. Of course, that's after they've had a chance to update their doctor on what they've been up to since they now see them as family. As always, Doctor Patel and Doctor C listen attentively as they excitedly share their newest adventures. -We've seen the office grow through the years, but our visits continue to be outstanding. This is the one place that you will be excited to visit and can count on leaving with a smile! Never thought that I would say that about a dental office, but it's true. We are truly grateful that we found such an amazing place and would definitely recommend Doctor C and Doctor Patel to anyone looking for a professional, experienced dental team with the most advanced technology available."
        },
        {
            "PersonID": "9V7awAavXhTfc6cKsVvx6w",
            "PersonURLpart": "/user_details?userid=9V7awAavXhTfc6cKsVvx6w",
            "PersonName": "Lily G.",
            "ReviewDate": "2017-03-24",
            "Rating": 5,
            "ReviewText": " Super awesome staff! Dr. Patel was great. This was my first visit to Enamel Dentistry, and every person who I spoke with was very friendly. They all were very informative. I got a tour of the clinic before I was seen, and was shown all the modern tools they use. They offer a menu of cold beverages to pillows and blankets to make you feel as comfortable as you are at home. I thought this was very different and cool!"
        },
        {
            "PersonID": "IpYqunrnhEc24lM3Tp2v7w",
            "PersonURLpart": "/user_details?userid=IpYqunrnhEc24lM3Tp2v7w",
            "PersonName": "Crystal S.",
            "ReviewDate": "2019-03-19",
            "Rating": 5,
            "ReviewText": " Dr. Devish and his staff are great! They are extremely friendly and attentive. They make sure you are comfortable and well informed. On my first routine visit it was discovered that I was on the verge of needing a root canal. When Dr. Devish discovered I couldn't get in the following day he decided to stay late and work on my molar right then and there, and this wasn't a short procedure. He even called me the next day to see how I was doing. That's great customer service! I highly recommend this practice."
        },
        {
            "PersonID": "voeUGzWbyOUTRhrONPwKzw",
            "PersonURLpart": "/user_details?userid=voeUGzWbyOUTRhrONPwKzw",
            "PersonName": "Casey M.",
            "ReviewDate": "2016-09-16",
            "Rating": 5,
            "ReviewText": " I needed a same-day appointment and Enamel came through... even though I was a first time patient. I was impressed by everything... the office, staff, professionalism, technology, and quality of the service provided. Dr. C and Dillon were fantastic. I have already referred them to friends and family and will continue to do so."
        },
        {
            "PersonID": "_rcHeMndTjpHH-ZV663zqQ",
            "PersonURLpart": "/user_details?userid=_rcHeMndTjpHH-ZV663zqQ",
            "PersonName": "Leslie B.",
            "ReviewDate": "2017-03-06",
            "Rating": 5,
            "ReviewText": " The best dentist I've ever been to! Dr. C, and Dylan were extremely informative, and thorough. I left there feeling confident about my future visits with their company."
        },
        {
            "PersonID": "-BpV24YNwzVR0J1CUPGnZA",
            "PersonURLpart": "/user_details?userid=-BpV24YNwzVR0J1CUPGnZA",
            "PersonName": "Tina G.",
            "ReviewDate": "2017-07-11",
            "Rating": 5,
            "ReviewText": " I had an awesome experience at the dentist today. The staff was friendly and ready to serve the patients. Who doesn't love free wine before an appointment??? The dentists and assistants were always clarifying to see if i understood what was being discussed and asked me if I had any questions. I left today knowing much more about my teeth than I did when I came in. I would recommend this business to anyone."
        },
        {
            "PersonID": "kDwhH9dmcQrBXTovdW-7iw",
            "PersonURLpart": "/user_details?userid=kDwhH9dmcQrBXTovdW-7iw",
            "PersonName": "Amy K.",
            "ReviewDate": "2018-12-12",
            "Rating": 1,
            "ReviewText": " Also, what's he going to clear up? I already paid, I'm not gonna get my money back. For services rendered. I got a second opinion, and I received proper care. So there's nothing to clear up Dr. Patel. I cleared it up already. I'm just glad I had people in my family encourage me to get a second opinion. I think your office is really cute. I just think you might need some more experienced dentists in there. Even if they don't work on the patients, they should be reviewing the files before additional treatment is done. Dr Patel may be trying to pay for his kids college fund LOL. He insisted on 3 crowns and 2 fillings w no symptoms from me. Got a second opinion and all were rejected besides one filling. I think all the 5 star reviews are because if you write one, you get free whitening trays. If that's all you're after then fine, go. But not for serious issues. They've only been there 2 years. Maybe if you judge a dentist by a \"tour\" of the facility, a \"comfort\" menu offering tea and coffee, and Netflix on a big screen at your personal chair, you're impressed. As an adult with a long term view of my dental care, I don't care about those \"perks\". I care about safe conservative treatment. Crowns affect you FOR LIFE. Don't judge a dentist on Netflix- judge them on experience and conservative care. Read more"
        },
        {
            "PersonID": "kpDLpjKBN14cR2D7DBUYlg",
            "PersonURLpart": "/user_details?userid=kpDLpjKBN14cR2D7DBUYlg",
            "PersonName": "Svetlana S.",
            "ReviewDate": "2018-12-10",
            "Rating": 5,
            "ReviewText": " This is probably one of the best dental facility as I've ever been to in my life. I couldn't ask for a better staff and professional doctors to be handling my dental care. It is always clean, they always offer you some sort of beverage, and they're always on time with your appointments. There is easy parking as well. The doctors are just some of the friendliest people I've ever met. They explain things so thoroughly and will answer any questions you may have. They also are very fast in the sense of they know what they're doing and they get their job done and waste no time. I am just so happy I've found this place. Business owner information Hardik C. Business Owner 12/10/2018 Thank you so much for the kind words! I’m glad you enjoy coming to us! We try very hard to make sure it’s an enjoyable experience for all of our patients and it reviews like yours that keep us going!Thanks!-Dr. Hardik Chodavadia and Dr. Devish Patel Read more"
        },
        {
            "PersonID": "RgoquDhxr_HfBih8iYV25Q",
            "PersonURLpart": "/user_details?userid=RgoquDhxr_HfBih8iYV25Q",
            "PersonName": "Davy B.",
            "ReviewDate": "2017-12-05",
            "Rating": 5,
            "ReviewText": " I'm so happy I was able to go see Duyen at Enamel and have my exam with Dr. C! Unfortunately, I don't remember the name of the receptionist, but she was so sweet and welcoming, as were the others I met today at Enamel. Duyen has such an attention to detail when cleaning and she is SO GENTLE! She stops to explain any questions or concerns you have, as well as explain why things might be the way they are. For example, I had no idea that I grind my teeth. Apparently just from my xrays she could tell! So happy to know why that's such a huge deal and how to prevent any significant damage. DR. C was great. He went over the different pictures of my teeth and of course the xrays. He let me know what might be a concern and to keep an eye on. Just warm and friendly. Dentists and doctors can be (albeit, understandably) so busy seeing so many different patients, and while they're typically always polite and professional, I can say with confidence that Dr C and everyone at Enamel not only possess these traits, but they are friendly! It's not your typical \"stiff and formal\" dentist's office, and I appreciate that. So happy with my visit here! Thanks everyone!"
        },
        {
            "PersonID": "NP-gfreLkEKLDXoLjd0twA",
            "PersonURLpart": "/user_details?userid=NP-gfreLkEKLDXoLjd0twA",
            "PersonName": "Katie E.",
            "ReviewDate": "2016-07-27",
            "Rating": 4,
            "ReviewText": " Very professional, polite and friendly. Lots of extra perks to help make comfortable while getting a cleaning; I watched Friends on Netflix  was in and out in under an hour"
        },
        {
            "PersonID": "A2Lj4VZpQhBoZIqTmXDebA",
            "PersonURLpart": "/user_details?userid=A2Lj4VZpQhBoZIqTmXDebA",
            "PersonName": "Alfredo P.",
            "ReviewDate": "2016-06-29",
            "Rating": 5,
            "ReviewText": " Got my first cleaning here the other day and these guys are great. Very friendly, very knowledgeable and make you feel very comfortable, and are very thorough in their work. Also open evenings which is great if you have a 9-5 where going during the day might be difficult. You can tell they really care about their patients and are looking out for your best interest. Feels like service like this is few and far between these days in this type of industry. Looking forward to having these great guys in the neighborhoodA+++"
        },
        {
            "PersonID": "C-SBIDttfEnoRmYcwlZURQ",
            "PersonURLpart": "/user_details?userid=C-SBIDttfEnoRmYcwlZURQ",
            "PersonName": "Mike C.",
            "ReviewDate": "2017-12-13",
            "Rating": 5,
            "ReviewText": " In all of my 70 years I must say Dr Patel is the best dentist I've ever had working on my teeth ! So happy I discovered this place, I can see why they have so many great reviews ! And best of all Enamel has to be one of the most reasonably priced dentist office in town ! I saved a Substantial amount of money, being on a fixed income, and I am Very pleased with the work Dr Patel has done!"
        },
        {
            "PersonID": "QSsnZiKgWxVBkN1yMtvQ2Q",
            "PersonURLpart": "/user_details?userid=QSsnZiKgWxVBkN1yMtvQ2Q",
            "PersonName": "A. J.",
            "ReviewDate": "2019-01-28",
            "Rating": 1,
            "ReviewText": " After I had cleared my schedule in the middle of the day to come in, the dentist refused to do a basic annual cleaning because I didn't want x-rays. I've been going to dentists and not getting x-rays for the last 30 years, it's outrageous that I would be turned away while already laying in the chair with a bib on because I didn't want to add on the money-making x-rays. He said he wasn't \"comfortable\" doing a basic oral exam and cleaning without x-raying my mouth. Perhaps reviewing the basics of dentistry would be helpful, since you can't get more elemental than that. It's very clear the motivation was financial and not some skewed sense of integrity. Terrible experience. Business owner information Hardik C. Business Owner 1/28/2019 Anon J,First and foremost I would to apologize for your experience, the last thing that we want is for a patient to leave feeling unsatisfied. It is our office policy to have a set of X-rays for any new patient, whether it be ones that we take or ones that the patient gives us from a previous office - it allows us to establish a baseline of a patient’s dental health. I can assure you it is not due to financial motivation as we often waive the associated fee with patients that are not eligible due to insurance restrictions. I apologize that it came off as disingenuous that was definitely not our intent. If you ever have any other questions or concerns please let us know!Thank you,Dr. Hardik Chodavadia Read more"
        },
        {
            "PersonID": "XsNEfBLQf1LXVAlDV-1IGw",
            "PersonURLpart": "/user_details?userid=XsNEfBLQf1LXVAlDV-1IGw",
            "PersonName": "Scott S.",
            "ReviewDate": "2018-03-26",
            "Rating": 5,
            "ReviewText": " Everybody was friendly and professional. The doctor was great and didn't make you feel rushed in any way. I have found my new dentist. Thanks everyone."
        },
        {
            "PersonID": "LjTql35hhku3J-z8Sl3leA",
            "PersonURLpart": "/user_details?userid=LjTql35hhku3J-z8Sl3leA",
            "PersonName": "Ray B.",
            "ReviewDate": "2018-04-11",
            "Rating": 5,
            "ReviewText": " These guys ROCK!! They have been superb since I started going here about a year ago. Saturday a crown popped off much to my chagrin, but Dr. C and his gang had me all fixed up this morning!! Kudos to an excellent dentist and staff. These guys ROCK!! They have been superb since I started going here about a year ago. Saturday a crown popped off much to my shagrin, but Dr. C and his gang had me all fixed up this morning!! Kudos to an excellent dentist and staff. Read more"
        },
        {
            "PersonID": "BrqI4euuGRfOLioP9Sc6bA",
            "PersonURLpart": "/user_details?userid=BrqI4euuGRfOLioP9Sc6bA",
            "PersonName": "Lisa H.",
            "ReviewDate": "2018-06-30",
            "Rating": 5,
            "ReviewText": " These guys are great!  The office has just a friendly vibe.  I broke my front teeth on a Thursday night and scrambled to find Someone to fix my teeth on Friday. My dentist does not have Friday hours. Dr. C was able to work me in and did a beautiful job fixing my teeth. They earned a new client with their customer focus!  When one of those repairs came out because of my actions, Dr. Patel fix me up beautifully too.  Again working me in on Friday afternoon.  I highly recommend this dental clinic."
        },
        {
            "PersonID": "k22gwckW4HjfnlQeM8Q56A",
            "PersonURLpart": "/user_details?userid=k22gwckW4HjfnlQeM8Q56A",
            "PersonName": "Kensi T.",
            "ReviewDate": "2016-10-03",
            "Rating": 5,
            "ReviewText": " First time at this office and it was so amazing. The office is in a great location and was easy to navigate to. The office staff and doctors were just so knowledgeable and very detailed with each patient. Was able to get right in and they determine the best procedure for me. This office was so clean and allowed patients to watch movies as they received their dental work. I would recommend this office to everyone. If you want to go to someone who knows what they are doing and not trying to sell you on more work than needed this is the place for you."
        },
        {
            "PersonID": "0qJDZ4GwbYHdVjJcCl_O3Q",
            "PersonURLpart": "/user_details?userid=0qJDZ4GwbYHdVjJcCl_O3Q",
            "PersonName": "Jillian L.",
            "ReviewDate": "2016-06-16",
            "Rating": 5,
            "ReviewText": " After quite some time not getting my teeth cleaned due to relocating to Austin I pulled the trigger and made an appointment with Dr Patel after receiving a flyer in my mailbox. The office is amazing. Each chair has its own tv with Netflix so it was like being in my living room having my teeth cleaned. The equipment is all brand spanking new and the chairs are really comfortable. I highly recommend checking this place out if you are looking for a new dentist!"
        },
        {
            "PersonID": "K0C0PcyI79AtW2wsgoGrgA",
            "PersonURLpart": "/user_details?userid=K0C0PcyI79AtW2wsgoGrgA",
            "PersonName": "Ileia M.",
            "ReviewDate": "2016-07-19",
            "Rating": 5,
            "ReviewText": " Updated dental office, great service. I was well informed about everything I was getting done. Answered all of my questions. I would recommend anyone looking for a new dental office to come here. They have tvs in every room I got to watch Netflix.  Best dentist experience I ever had..."
        },
        {
            "PersonID": "w_4CPaKlC4VFwvMSowfswQ",
            "PersonURLpart": "/user_details?userid=w_4CPaKlC4VFwvMSowfswQ",
            "PersonName": "Rob W.",
            "ReviewDate": "2017-03-28",
            "Rating": 1,
            "ReviewText": " This is a business, not a dentist. Every visit they try to sell you more stuff. Buy their electric toothbrush with bluettooth, buy the flossing kit, buy the mouthguard, and make sure you come back in a few weeks so we can sell you even more stuff you don't need! Business owner information Hardik C. Business Owner 3/29/2017 Rob,First and foremost, I would like to apologize for you experience at our practice. We started our practice in order to serve our patient to the highest quality of care while making sure that each patient's treatment is catered to their specific needs.  The last thing that we want is for our patients to feel like they are getting \"sold\" on things that they do not need. We try to be as transparent as possible when discussing what treatment needs to be completed and why it is necessary. Our goal is to make the patient an active participant in their oral health so our job as a dentist is more of an advisory role.You did mention that we tried to sell you a toothbrush, while we do offer an electric toothbrush at our office we sell them at cost (which is often lower than what is available in retail) to help our patients, we do not make a profit on this. We do not sell any \"flossing kits\" nor have we ever sold any floss or flossing aides at our office. Often times we refer our patients to Amazon if we feel as though it may help our patients improve their oral health, and I can assure you Amazon does not cut us in. Anything we recommend is to help our patients improve their health, I apologize if it came off as us trying to sell you anything unnecessary that was not our intent. If you ever need anything from us or have any problems, please do not hesitate to reach out! Thank you,Dr. Devish Patel and Dr. Hardik Chodavadia Read more"
        },
        {
            "PersonID": "wRYQJlrbSeUANWmI3xaSjw",
            "PersonURLpart": "/user_details?userid=wRYQJlrbSeUANWmI3xaSjw",
            "PersonName": "Kyle S.",
            "ReviewDate": "2016-11-10",
            "Rating": 5,
            "ReviewText": " Enamel Dentistry is hands down the best dentist I have ever been to. Starting with the friendliest staff, everyone greets you with a huge smile. When called back, I was given a tour of their office and then had an explanation of what all they would be doing for my appointment. Both before and after, I was told exactly what work they were doing and they made sure that I was in no pain during. Did I mention, you get to choose a show on Netflix to watch throughout your exam?! This was also one of the first times that I have been in and out without being in pain and bleeding after. Enamel has such a great team and I can't wait to go back!"
        },
        {
            "PersonID": "xBVSY95vfwruxKQOvzNggw",
            "PersonURLpart": "/user_details?userid=xBVSY95vfwruxKQOvzNggw",
            "PersonName": "Isabel C.",
            "ReviewDate": "2018-11-01",
            "Rating": 5,
            "ReviewText": " Dr. C and the dental assistant Ally were amazing this weekend when I went for my cleaning !! Receptionist Sarah was so welcoming and so sweet throughout our interactions. Definitely recommend !!"
        },
        {
            "PersonID": "9CVgA77IDrKxf-_iDRpUOA",
            "PersonURLpart": "/user_details?userid=9CVgA77IDrKxf-_iDRpUOA",
            "PersonName": "Geetu L.",
            "ReviewDate": "2016-08-01",
            "Rating": 5,
            "ReviewText": " So a little biased here because I know the dentists personally- but hear me out. I am pretty familiar with the dental industry having been a dental rep for a few years. With that said- I know when a dental professional is good or not. Well... I just had my teeth cleaned and was very pleased with the experience. 1) Thorough-  Dr. Patel took time/energy to ensure my problem areas were treated with care2) Informative- I define a good dentist/hygienist when they educate you about proper techniques along the way. Dr. Patel ended the appointment by teaching me how to properly floss. This may seem rudimentary but only 30% of people floss and most people don't know how to floss. Therefore, education is key.3) Comfort- Both dentists will go out of their way to ensure your comfort throughout the process with their unique offerings including a pillow.4) Passion/Knowledgeable- Recent graduates tend to have state of the art machinery, passion for that they do, and a brain full of fresh knowledge- all of which you will see at Enamel Dentistry.Overall- I highly recommend you get your treatment at Enamel Dentistry. You won't be disappointed."
        },
        {
            "PersonID": "zqwf8ZJLOkzFvgcdQlikeQ",
            "PersonURLpart": "/user_details?userid=zqwf8ZJLOkzFvgcdQlikeQ",
            "PersonName": "Emily P.",
            "ReviewDate": "2016-06-02",
            "Rating": 5,
            "ReviewText": " I don't normally write reviews but I was so happy with my experience and loved the staff at Enamel! I just moved to Austin and my friend recommended them and I'm so glad she did. I've never walked into a dental office that had more personal service than here. They were super friendly over the phone when I called to make an appointment and were just as friendly when I arrived.They even have chargers available for your phone if you're anything like me and appreciate that kind of thing..The dentists are really personable and friendly. I've had bad experiences with dentists in the past who overbook and make me wait for over an hour for a 5 minute appointment. It's definitely not like that here. They're thorough, professional and aren't rushing me out the door. I felt cared for and informed. I highly recommend them!!"
        },
        {
            "PersonID": "y68j9mDfAjwbk0k4T7GwAg",
            "PersonURLpart": "/user_details?userid=y68j9mDfAjwbk0k4T7GwAg",
            "PersonName": "Akhil P.",
            "ReviewDate": "2018-09-10",
            "Rating": 5,
            "ReviewText": " Great dental office, its very clean and the staff is super friendly. The doctors actually explain what they are going to do to you and provide you with a sense of security while performing quality work. An added bonus is you also get to watch Netflix while getting your teeth cleaned. Dr. Patel even taught me how to properly floss. They really care about the patient."
        },
        {
            "PersonID": "IK0PTGMuch6rBmfEwIV_Xg",
            "PersonURLpart": "/user_details?userid=IK0PTGMuch6rBmfEwIV_Xg",
            "PersonName": "Adam E.",
            "ReviewDate": "2017-10-12",
            "Rating": 5,
            "ReviewText": " Amazing experience! The office was very clean and modern. They even offer Netflix while you're getting cleaned. Dr C was very informative and helped me understand how to better care for my teeth"
        },
        {
            "PersonID": "Go8fiQc39DsywxKgk6sSFA",
            "PersonURLpart": "/user_details?userid=Go8fiQc39DsywxKgk6sSFA",
            "PersonName": "Brittany B.",
            "ReviewDate": "2016-06-14",
            "Rating": 5,
            "ReviewText": " Dr. Chodavadia ( Dr. C) is an exceptional dentist! I had to have an extraction while pregnant! Was initially quite nervous because I was not able to utilize the typical pain remedies considering I am pregnant. I did not feel a single thing. They were extremely hospitable and took care of my every need. Wireless headphones, phone charger, TV and remote. Would absolutely recommend Enamel Dentistry to my closest friends and family!"
        },
        {
            "PersonID": "SqpO8Dde0edxTMr0ofJ_MQ",
            "PersonURLpart": "/user_details?userid=SqpO8Dde0edxTMr0ofJ_MQ",
            "PersonName": "Meg B.",
            "ReviewDate": "2016-10-07",
            "Rating": 5,
            "ReviewText": " I'm really glad I found this place. My visit consists of friendly interactions and comforting amenities, and I don't even mind my dental appointments. That says a lot about someone who prefers sedation, and dreads having my teeth cleaned. I also enjoy feeling like I'm a spa, and they have the most kick ass artwork that cracks me up. Think Abe Lincoln dressed as a record producer- complete with one earring. It's my kind of place."
        },
        {
            "PersonID": "aDAXJiGlSDB04SQ2m9FkbQ",
            "PersonURLpart": "/user_details?userid=aDAXJiGlSDB04SQ2m9FkbQ",
            "PersonName": "Brendan E.",
            "ReviewDate": "2016-12-15",
            "Rating": 5,
            "ReviewText": " I love these guys! They have the best in class staff, technology, and dentists here! A place you can TRUST! Without a doubt the best experience I've ever had at a dentistry - for real.  Dr. Chovdavadia took very good care of my teeth and did a thorough examination and cleaning. He also explained everything to me and was very courteous and professional. He has a great sense of humor and everyone in the office is energetic. The doctor did the cleaning himself too - which is not something you really get from other places. I am very happy I found this place."
        },
        {
            "PersonID": "PI9PsgQ4nJQB4RGJTQdqCw",
            "PersonURLpart": "/user_details?userid=PI9PsgQ4nJQB4RGJTQdqCw",
            "PersonName": "Kiel S.",
            "ReviewDate": "2017-03-01",
            "Rating": 5,
            "ReviewText": " Dr. Chodavadia (Dr. C) and his team are amazing. I went in for a general cleaning and consultation knowing that I had some work that needed to be done. Dr. C was wonderful, he is knowledgeable and didn't mince words with me about what he thought were the priorities. We came up with a good treatment plan together and I went in a week later to begin treatment. I have really bad anxiety when it comes to the dentist and the team Enamel made me feel at ease. They also have a complimentary menu of things, from pillows and blankets to coffee and beer."
        },
        {
            "PersonID": "nsqJDLRuhDY_xwkTCw6R2g",
            "PersonURLpart": "/user_details?userid=nsqJDLRuhDY_xwkTCw6R2g",
            "PersonName": "Dee R.",
            "ReviewDate": "2017-11-06",
            "Rating": 5,
            "ReviewText": " First let me stay, I appreciate all the bells and whistles some dentists have, the friendly staff, competent receptionists, and short wait times, but bottom line for me is the actual dental work.  I first came here a few months ago with a root canal gone wrong that I'd been worrying about for about a year, and avoiding dealing with.  It was my first visit at Enamel, and what remained of the tooth was extracted in a few minutes!  Painless, problem solved, just like that!.  I also had a large filling that had fallen out replaced at that same visit, and my insurance covered pretty much everything but the copay.  I'll be coming back for deep cleaning, and to fix a couple more cavities, and I'm really happy I found these guys!"
        },
        {
            "PersonID": "xX2zx-8nTR7UmVQH1Lg_eg",
            "PersonURLpart": "/user_details?userid=xX2zx-8nTR7UmVQH1Lg_eg",
            "PersonName": "Rachel M.",
            "ReviewDate": "2017-06-24",
            "Rating": 5,
            "ReviewText": " Had a great experience at my cleaning the other day. My husband is a patient and told me what a great experience he had and I was looking for a new dentist so thought I'd give them a try. I saw Dr. Patel and he spent the most time out of any dentist I have ever seen, ever, discussing different topics with me. He cited the research and was very opened minded and respectful about me leaning towards a holistic approach. They definitely make time for their patients."
        },
        {
            "PersonID": "uQ5wwbke28t0AtteVCt3oA",
            "PersonURLpart": "/user_details?userid=uQ5wwbke28t0AtteVCt3oA",
            "PersonName": "Manali P.",
            "ReviewDate": "2018-04-27",
            "Rating": 5,
            "ReviewText": " The staff is very friendly and hospitable. They answered all my questions before and after my procedure. Dr. Hardik was great and very patient. I would definitely recommend them."
        },
        {
            "PersonID": "9JuCyNI7PqYF8WY7CdTABQ",
            "PersonURLpart": "/user_details?userid=9JuCyNI7PqYF8WY7CdTABQ",
            "PersonName": "Ella T.",
            "ReviewDate": "2018-04-13",
            "Rating": 5,
            "ReviewText": " State of the art facility and equipment. Staff was super friendly and made me feel comfortable despite not having been to the dentist in a couple of years. I highly recommend a visit to Dr. C!"
        },
        {
            "PersonID": "R1eZLfQKVDtLZsIWKPTbbw",
            "PersonURLpart": "/user_details?userid=R1eZLfQKVDtLZsIWKPTbbw",
            "PersonName": "Shahid S.",
            "ReviewDate": "2018-03-23",
            "Rating": 2,
            "ReviewText": " I took this office because of good reviewed in Yelp but unfortunately my experience was not good and satisfied. Here what I faced when I visited to office. 1. Office looks very nice and cleaned.2. staff looks very nice and cooperative.3. The lady who took my X-rays she gave me hard time because she took many times and one type of X-rays was so difficult that she put one object in my mouth that hurts me and my gum was bleeding after that. And she was getting help from her colleagues also.4. Doctor Patel looks to me so hurry and rushy to move next patient and one time he went for few minutes also. And he finished his talk quickly with me and moved to the next patient without saying any thing to me regarding that you can check with front desk so then front desk lady asked me about are you ready to check out but I said that don't know b/c nobody tell me. Anyway she went to the doctor and got the details regarding what she wanted to do with the patient like what bills needs to charge and what future plan. 5. Lastly as usual every dentist has a huge bills and next future plan so it expensive.Anyway I will not consider next time for this office. But I put these comments for the people who want to visit next."
        },
        {
            "PersonID": "QNp57_VQpKVB-Wb7tKPK_Q",
            "PersonURLpart": "/user_details?userid=QNp57_VQpKVB-Wb7tKPK_Q",
            "PersonName": "Jonathan S.",
            "ReviewDate": "2017-05-03",
            "Rating": 5,
            "ReviewText": " Choosing a dentist in a new city is always tough but not if you choose Enamel. Couldn't be happier with our decision, the overall experience and the modern office."
        },
        {
            "PersonID": "HHo7UqkWNsc8-Cm_r6XvtQ",
            "PersonURLpart": "/user_details?userid=HHo7UqkWNsc8-Cm_r6XvtQ",
            "PersonName": "Heather G.",
            "ReviewDate": "2016-10-01",
            "Rating": 5,
            "ReviewText": " I been living in Austin for 11 years and never found a dentist I liked. I still see a dentist in philly.  I literally fly like two thousand miles to go see my dentist who I think is about 110 years old now. I own a business behind the Ceilo building and saw this place open. So I decided to give them a call and see if I could get my teeths cleaned. The lady who answered the phone was super nice and got me in the same day. I got there and the place is beautiful. The front desk lady offered me a beer. What!!! A beer? Only in Austin. Of course I said yes. What a good idea maybe I should start handing out beers at my office. I forget his name but a really nice guy gave me a tour of their office and took some x rays. The dentist,  who was not 110 years old,  was super cool. I have never had the actually Dentist clean my teeth before usually a hygienist does the clean and the Dentist just checks out my mouth for like 5 second. But at this office the actual Dentist cleaned my choppers. This place is awesome. They have a new client promo for $88 (or something like that) for first cleaning.  Totally worth it. I'll see you guys in 6 month when the choppers need another polishing."
        },
        {
            "PersonID": "O2rwNtFlGCFpok2QHoQtEw",
            "PersonURLpart": "/user_details?userid=O2rwNtFlGCFpok2QHoQtEw",
            "PersonName": "Eric G.",
            "ReviewDate": "2017-07-12",
            "Rating": 5,
            "ReviewText": " What a great experience! I called in the morning, having not slept the night before because of the nerve pain from a broken filling. They let me come in immediately (although I haven't been a patient there before), and in less than an hour I was getting a root canal. Dr C explained everything as he did it and it was a really good experience. The cherry on top were the perks with the offer of free drinks, Netflix as you're waiting, and super friendly staff. I'll be recommending them to everyone I know."
        },
        {
            "PersonID": "ATs4kw8oWrA4HnvAeh3N9Q",
            "PersonURLpart": "/user_details?userid=ATs4kw8oWrA4HnvAeh3N9Q",
            "PersonName": "Nitin G.",
            "ReviewDate": "2016-07-23",
            "Rating": 3,
            "ReviewText": " Really modern place and friendly staff, but not sure I'll go back. I went for a cleaning and before the cleaning even started, the dentist was trying to talk me into prepaying for a crown (while I was in the chair). Probably was an honest mistake, but a strong upsell before the visit was even complete was a turn off. Business owner information Hardik C. Business Owner 8/1/2016 We appreciate the feedback and apologize for the misunderstanding related to your experience here at Enamel Dentistry. We usually present treatment plans before the cleaning in case the patient would like to take care of any treatment that day to save them a visit and having to take extra time out of work or any other obligations! It is certainly not our intention to try and sell you any sort of services that we may recommend. We were short staffed at the time, so the Doctor was unfortunately doing administrative duties that he usually not tasked with as well. Please give us a call if there is anything we can do or if you have any questions! Read more"
        },
        {
            "PersonID": "5WRfFz0vCIcCMXrDf_NvAw",
            "PersonURLpart": "/user_details?userid=5WRfFz0vCIcCMXrDf_NvAw",
            "PersonName": "Regina P.",
            "ReviewDate": "2017-04-06",
            "Rating": 5,
            "ReviewText": " Great dentist!  Modern equipment, comfortable atmosphere, great staff and Netflix!!!  Definitely check them out, especially if you have had a fear of dentists in the past. No worries here!"
        },
        {
            "PersonID": "j9kbVBdSQ1KfmF-xaLQchA",
            "PersonURLpart": "/user_details?userid=j9kbVBdSQ1KfmF-xaLQchA",
            "PersonName": "Leslie S.",
            "ReviewDate": "2016-07-07",
            "Rating": 5,
            "ReviewText": " Wonderful team and really cool office in the building I live in (convenient!!). The comfort menu is adorable, pretty unique and although it was mid workday it was tempting!! They also offer a pillow/blanket on there. You can catch up on episodes of your favorite shows on Netflix while you're getting your cleaning and all of the machines are new and top of the line! They made me feel comfortable and were fun to chat with. Going back for sure - thanks guys!"
        },
        {
            "PersonID": "jcsKAuvvlYJaPi3RdyJj7Q",
            "PersonURLpart": "/user_details?userid=jcsKAuvvlYJaPi3RdyJj7Q",
            "PersonName": "Red R.",
            "ReviewDate": "2017-08-18",
            "Rating": 5,
            "ReviewText": " I have had a wonderful experience with Dr C and his team. He helped me find effective solutions to managing TMJ, the night guard he ordered me gave immediate relief and has been super comfortable to use. It is obvious to me that he is extremely well trained and he loves what he does, and this makes such a difference when someone is in a position to care for others and does so from this positive space. Thank you!"
        },
        {
            "PersonID": "V46i9blze6pc8h8HGtXwjg",
            "PersonURLpart": "/user_details?userid=V46i9blze6pc8h8HGtXwjg",
            "PersonName": "Patrick E.",
            "ReviewDate": "2017-09-13",
            "Rating": 5,
            "ReviewText": " Dr.C is amazing!!! I have been impressed with all my basic dental care but Dr.C goes above and beyond. I chipped my front tooth on a Friday night and Dr.C came in on a Saturday morning to fix it. Could not thank him enough."
        },
        {
            "PersonID": "A4CSrn3wf9LZFMUVpyB0QA",
            "PersonURLpart": "/user_details?userid=A4CSrn3wf9LZFMUVpyB0QA",
            "PersonName": "Lauren M.",
            "ReviewDate": "2017-10-21",
            "Rating": 5,
            "ReviewText": " I'm very appreciative of the hardworking and kind team at Enamel Dentistry. I was initially apprehensive about receiving a crown on my front tooth. Dr. Patel, and all of the dental technicians reassured me, and provided answers to all of my questions, no matter how paranoid they sounded. The temporary and the permanent crown were done so well, that literally no one has noticed that there's anything different with my smile. Dr. Patel was great. He made me laugh, and provided quality dental care. The exact same can be said for the technicians. I definitely recommend this office. I almost forgot! Big shoutout to all the front office staff, who greeted me, sometimes even by name, and were super patient as I figured out payment!!"
        },
        {
            "PersonID": "b2RNf8S1vO3kimwIYlJKIw",
            "PersonURLpart": "/user_details?userid=b2RNf8S1vO3kimwIYlJKIw",
            "PersonName": "Elizabeth C.",
            "ReviewDate": "2017-03-23",
            "Rating": 5,
            "ReviewText": " For someone that doesn't love going to the dentist, I've had a great experience here. Super friendly staff that makes you feel comfortable and is extremely informative. TV's in every room with Netflix, complimentary beverages and good music! Text message reminders for upcoming appointments and Dr Patel called me personally to check-in on me after I had a crown put in. Never changing dentists again!"
        },
        {
            "PersonID": "w3yN7emWiBT81U9Gk8sYQg",
            "PersonURLpart": "/user_details?userid=w3yN7emWiBT81U9Gk8sYQg",
            "PersonName": "Brandi M.",
            "ReviewDate": "2017-06-03",
            "Rating": 5,
            "ReviewText": " I had a crown break at 5pm on Friday and they were kind enough to see me Saturday morning even though the office wasn't open. I'm so grateful and will be coming back as a regular patient."
        },
        {
            "PersonID": "XHt7qSsP0cviT9u0rt5WkQ",
            "PersonURLpart": "/user_details?userid=XHt7qSsP0cviT9u0rt5WkQ",
            "PersonName": "Raj S.",
            "ReviewDate": "2016-10-26",
            "Rating": 5,
            "ReviewText": " Dr D. Patel is extremely knowledgeable, courteous and totally committed to patients dental care. They have state of art instruments and utilizes latest technology to help patients. I strongly recommend this dental group , they just began their practice in Austin, I am sure pretty soon there will be waiting list to get their appointments."
        },
        {
            "PersonID": "jvWlE7sNOfG-FL4ZIYLzOg",
            "PersonURLpart": "/user_details?userid=jvWlE7sNOfG-FL4ZIYLzOg",
            "PersonName": "Lauren W.",
            "ReviewDate": "2017-08-17",
            "Rating": 5,
            "ReviewText": " Can't say enough about this place! This is my first time visiting the dentist in the Austin area and I don't plan on going anywhere else. All staff is very welcoming and friendly....I love that they understand the importance of customer service. Would highly recommend!"
        },
        {
            "PersonID": "XHOu8Oe6-uPCcLUm4HVbQA",
            "PersonURLpart": "/user_details?userid=XHOu8Oe6-uPCcLUm4HVbQA",
            "PersonName": "Laura G.",
            "ReviewDate": "2017-06-22",
            "Rating": 5,
            "ReviewText": " Great place! Clean and up to date facilities with a fun vibe and nice staff. Will definitely return!"
        },
        {
            "PersonID": "aZbqv1-_pYNbgirneA2w8Q",
            "PersonURLpart": "/user_details?userid=aZbqv1-_pYNbgirneA2w8Q",
            "PersonName": "Milan K.",
            "ReviewDate": "2017-01-28",
            "Rating": 5,
            "ReviewText": " Awesome office, super convenient location, and Dr. C was great!"
        },
        {
            "PersonID": "EFAYWLbzrBVT0NPdpdM_iA",
            "PersonURLpart": "/user_details?userid=EFAYWLbzrBVT0NPdpdM_iA",
            "PersonName": "Dana V.",
            "ReviewDate": "2017-05-15",
            "Rating": 5,
            "ReviewText": " I chipped my two front teeth 3 hours before I was in a wedding and Enamel Dentistry took me right away for an emergency appointment and fixed me beautifully! They had an amazing office staff and Dr. Patel was amazing. I am so lucky I was able to find such an amazing dentist being from out of town. I highly recommend his office. I wish I lived in Austin!!!"
        },
        {
            "PersonID": "j237kqPhaLafgPKfWWSD7w",
            "PersonURLpart": "/user_details?userid=j237kqPhaLafgPKfWWSD7w",
            "PersonName": "Matthew S.",
            "ReviewDate": "2017-03-22",
            "Rating": 5,
            "ReviewText": " Excellent experience! Courteous staff and welcoming environment. Look forward to my next visit. Thanks!"
        },
        {
            "PersonID": "klvf_XMWZrJMocPXuNMQ3Q",
            "PersonURLpart": "/user_details?userid=klvf_XMWZrJMocPXuNMQ3Q",
            "PersonName": "Zach F.",
            "ReviewDate": "2017-03-14",
            "Rating": 5,
            "ReviewText": " Such an outstanding experience I bragged to my coworkers when I got back.  There are the \"luxury\" or \"concierge\" offerings like the beer or wine and hot towel and TV in the exam rooms, but most importantly Dr. C and his staff were incredibly sincere, funny, kind, and patient and outstanding in their expertise.  Dr. C took his time explaining what he thought was important to address and what he thought was worth just watching and waiting, and he performed the cleaning himself.  You definitely don't feel like you're on an assembly line here.  And his office is very transparent about pricing.  Couldn't recommend it more."
        },
        {
            "PersonID": "cAt98nuQjUdH58sBCH0_CA",
            "PersonURLpart": "/user_details?userid=cAt98nuQjUdH58sBCH0_CA",
            "PersonName": "Mike M.",
            "ReviewDate": "2017-02-01",
            "Rating": 5,
            "ReviewText": " Ive lived all over the world and had dentistry in many countries, good and bad. From the moment you enter ENAMEL and NICOLE greets you you know your going to be in good hands, Dr C is amazing, I had a broken tooth, soon I had a temporary cap, no pain,. After fitting new crown Dr C said he didn't like its fit and he would redo at no cost. Did that today. I have to say Dc and his whole team is amazing, friendly, professional even coffee and other liquid refreshments. And I mustn't forget all the very latest equipment in spotless surroundings."
        },
        {
            "PersonID": "Ty8ooFWPm3FgSMFFkmZdyg",
            "PersonURLpart": "/user_details?userid=Ty8ooFWPm3FgSMFFkmZdyg",
            "PersonName": "Richard B.",
            "ReviewDate": "2016-08-05",
            "Rating": 5,
            "ReviewText": " Great first experience! Friendly staff and cool office with new modern equipment. Will definitely be back."
        },
        {
            "PersonID": "mGBmiATMxwYD7G6TM_b1SQ",
            "PersonURLpart": "/user_details?userid=mGBmiATMxwYD7G6TM_b1SQ",
            "PersonName": "Ramona A.",
            "ReviewDate": "2016-08-05",
            "Rating": 5,
            "ReviewText": " Beautiful office and friendly staff! Dr. Patel took the time to walk me through the appointment from start to finish - with patience, details and thoughtfulness. He performed my general cleaning and was very thorough - periodically checking in to make sure that I was comfortable and aware of what he was doing. I left with a good sense of preventative care and next steps. Overall a great experience!"
        },
        {
            "PersonID": "MTv_m75pSVKxIK5yIaXyzw",
            "PersonURLpart": "/user_details?userid=MTv_m75pSVKxIK5yIaXyzw",
            "PersonName": "Heather D.",
            "ReviewDate": "2016-07-18",
            "Rating": 5,
            "ReviewText": " Enamel has a welcoming and fun little office! There is a cute comfort menu where they offer beverages and other small things. There are awesome hipster paintings of the Presidents around the office. The staff is extremely friendly and make visiting the dentist well worth it! They have reasonable prices for their services. The Dentists and assistants are great and walk you through each step during your visit. I'm very excited to have found a great new Dentist office in Austin! One of the friendliest and nicest group of people I've met! Thank you, Enamel!!"
        }
    ],
    "TotalReviews": 185
}